{
    "perPage": 20,
    "page": 1,
    "total": 30,
    "className": "job",
    "models": [
        {
            "job_id": "23cbfcb5da3f9f0bba4b0e78bb2d93d7",
            "name": "PwC",
            "blind_flag": 0,
            "job_desc": "<p><strong>NOTE: These opportunities are not with PwC US, but with another firm in the PricewaterhouseCoopers global network of firms, each of which is a separate legal entity. The PwC network firm has asked PwC US to post this opportunity to students attending a US-based university or college. As these positions are with another PwC network firm, that PwC network firm will manage the recruiting process, make the hiring decision, and set the terms and conditions of employment.</strong>&nbsp;</p>\r\n<p></p>\r\n<p><strong>PwC Overview:</strong></p>\r\n<p></p>\r\n<p>PwC is a community of solvers coming together, creating purposeful innovations for tomorrow, powered by tech. Here, we build and sustain trust in society, and we count on people like you to make it happen.&nbsp;</p>\r\n<p></p>\r\n<p>Working in one of the most exciting regions in the world, you will grow professionally as you experience working with various industries and clients. If you join us, you will help organizations meet the challenges and opportunities of the global marketplace in the areas of audit, tax, consulting and products and services.</p>\r\n<p></p>\r\n<p>The PwC new joiner experience includes a personalized digital experience, exposure to diverse client work, real-time development from your coaching team and tools to support your well-being. With the full support of the firm you&rsquo;ll develop your business acumen and digital skills helping you to become future-proof.&nbsp;</p>\r\n<p></p>\r\n<p><strong>PwC - Mainland China, Hong Kong SAR and Macau SAR</strong></p>\r\n<p></p>\r\n<p>PwC Mainland China, Hong Kong SAR and Macau SAR work together on a collaborative basis, subject to local applicable laws. Collectively, we have over 800 partners and more than 20,000 people in total.&nbsp;</p>\r\n<p></p>\r\n<p>We provide organisations with the professional service they need, wherever they may be located. Our highly qualified, experienced professionals listen to different points of view to help organisations solve their business issues and identify and maximise the opportunities they seek. Our industry specialisation allows us to help co-create solutions with our clients for their sector of interest.&nbsp;</p>\r\n<p></p>\r\n<p>We are located in these cities: Beijing, Shanghai, Hong Kong, Shenyang, Tianjin, Dalian, Jinan, Qingdao, Zhengzhou, Xi&rsquo;an, Nanjing, Hefei, Suzhou, Wuxi, Wuhan, Chengdu, Hangzhou, Ningbo, Chongqing, Changsha, Kunming, Xiamen, Guangzhou, Shenzhen, Macau, Haikou, Zhuhai and Guiyang.</p>\r\n<p></p>\r\n<p><strong>Job Description:</strong></p>\r\n<p></p>\r\n<p>PwC currently has a good number of positions available across our service lines in assurance, tax, advisory and one firm services, in various locations in China and Hong Kong. Positions are for Fall 2022 full time Associate roles.&nbsp;Please visit our CSI opportunities website as below for the list of open positions and respective job descriptions.&nbsp;</p>\r\n<p></p>\r\n<p><a href=\"https://www.pwccn.com/en/careers/students/china-sourcing-initiative/opportunities.html\" target=\"_blank\" rel=\"noopener\">https://www.pwccn.com/en/careers/students/china-sourcing-initiative/opportunities.html</a>&nbsp;</p>\r\n<p></p>\r\n<p><strong>Qualifications:</strong></p>\r\n<p></p>\r\n<p>Please see specific requirements for the opportunity you are interested in by visiting the links for each respective position provided above in the &ldquo;Job Description&rdquo; section.&nbsp;</p>\r\n<p></p>\r\n<p><strong>How to apply:</strong></p>\r\n<p></p>\r\n<p>IMPORTANT - In order to be considered for one of PwC CSI's open positions, you must apply by visiting &nbsp;<a href=\"https://www.pwccn.com/en/careers/students/china-sourcing-initiative.html\" target=\"_blank\" rel=\"noopener\">https://www.pwccn.com/en/careers/students/china-sourcing-initiative.html</a> Once there, you can read more about the CSI program and CSI &ldquo;Opportunities&rdquo; we recruit in 2021 Fall. You can sign up for one session from the &ldquo;CSI Information Session Schedule&rdquo; for more details about how we will support you this fall.</p>\r\n<p></p>\r\n<p>Don&rsquo;t forget to scroll down to the &ldquo;Application journey&rdquo; for our key timeline of the application process. You can also meet our people virtually to understand their PwC stories. After reviewing the contents about the CSI program, click on the \"Apply Now\" button to start your application.&nbsp;</p>\r\n<p></p>\r\n<p>You will need to set up an application account to proceed with the application. Please select &ldquo;CSI (Virtual interview in US/Canada)&rdquo; as the opportunity you are interested in when you reply to the first question of &ldquo;Preference&rdquo; in your application form. Before completing your application form, <strong>please ensure to upload a current resume/CV in English. Please submit your application and complete your Game Based Assessment (GBA) if you are based in the United States.&nbsp;</strong></p>\r\n<p></p>\r\n<p>Upon submitting your application, you will receive a confirmation email with a Game-Based Assessment (GBA) invitation from &ldquo;<a href=\"mailto:Enterprise@trm.brassring.com\" target=\"_blank\" rel=\"noopener\">Campus_China&lt;Enterprise@trm.brassring.com&gt;</a>&rdquo;, which will also include a system generated 8-digit candidate reference number. Please keep this reference number on file as the recruiter will be referencing this number throughout the recruitment process.&nbsp;</p>\r\n<p>The Game-Based Assessment (GBA) and Artificial Intelligence Video Interview (AIVI) (for those who pass the GBA) make up our two-step online assessment process.</p>\r\n<p></p>\r\n<p>Please ensure to complete the first step (GBA) within 48 hours upon receiving your invitation email. CSI recruiters will review your candidate profiles and invite selected candidates for the AI Video Interview.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Once you finish all the required items above, you are all set!</p>",
            "visual_id": "40852",
            "job_title": "PwC China Sourcing Initiative (CSI) Full-Time 2022 Opport.",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-04-23T00:00:00-04:00",
                "job_end": "2022-05-30T23:59:59-04:00"
            },
            "postdate": "Apr 23, 2022",
            "deadline": "May 30, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Multiple Locations",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/1b5/1b56379ae984209dc70c059c484d8215.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T072355Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=016b1c7dd04d240c618785ad85c3f6e49d8f66054d61db5ab24f0fd9eec4b722",
            "favorite": false
        },
        {
            "job_id": "9d9c86d481bc028ff75be3b00f6cc3fd",
            "name": "Ernst & Young LLP",
            "blind_flag": 0,
            "job_desc": "<p>Core Business Services - Launch Intern&nbsp;<br />&nbsp;<br />At EY, you&rsquo;ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we&rsquo;re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.</p>\r\n<p><br />EY offers a variety of career paths and opportunities, and with so many options, we understand it can be hard to choose. To have the best candidate experience, we encourage you to apply to&nbsp;no more than 2 positions within a 6-month period.</p>\r\n<p><br />To learn more about career opportunities, visit Careers at EY (https://www.ey.com/en_us/careers). Prior to completing your application, please be diligent in reviewing the job description to ensure you meet the qualifications for the position.</p>\r\n<p><br />If we are unable to consider you for this particular position, a recruiter may contact you to gauge your interest in other opportunities at EY.<br />&nbsp;<br />What if your career could have a lasting impact on you, and on the world?&nbsp;<br />Here at EY, you&rsquo;ll have the chance to build a truly exceptional experience. We&rsquo;ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you&rsquo;ll develop the skillsets you need to stay relevant today and in the future &ndash; all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.&nbsp;&nbsp;<br />&nbsp;<br />The opportunity: your next adventure awaits.<br />&nbsp;<br />Everything we do comes back to building a better working world, and that takes colleagues from all walks of life &ndash; each with their own unique perspective and skills.&nbsp;&nbsp;Our Launch program is just one platform designed to support and develop underrepresented groups within the professional services industry. With a structured step-by-step approach, it&rsquo;s the perfect place to gain hands-on experience alongside seasoned industry professionals.&nbsp;<br />&nbsp;<br />This program is all about giving you a solid foundation on which to develop your career. That covers everything from deciding on a direction suited to your own talents and ambitions to advise on how best to further pursue that goal. What&rsquo;s more, you&rsquo;ll build a varied network of colleagues, who could influence your career wherever you go in the future.&nbsp;<br />&nbsp;<br />This is a rotational program, so you&rsquo;ll learn all about a wide variety of areas and service lines specific to your&nbsp;market and&nbsp;interests&nbsp;such as Assurance, Consulting, and Tax. Whichever areas you visit, this is a true learning experience where you&rsquo;re likely to spend time rotating around and supporting colleagues on live projects right from the&nbsp;start and&nbsp;observing conflict management and team dynamics. You can expect plenty of chances to discover the true inner workings of a highly respected global brand, all while practicing the technical, business and communication skills that will set your career apart.&nbsp;<br />&nbsp;<br />Your key responsibilities&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Building an intimate understanding of our service lines and professional services&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Developing a foundation for the most sought-after business skills through classroom and on the job training&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Nurturing relationships with colleagues, potentially identifying mentors who can contribute to your success&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Discovering and adapting to our unique collaborative culture&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Personally&nbsp;considering and communicating where you&rsquo;ll like your future career to take you&nbsp;<br />&nbsp;<br />What we look for&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You have an agile, growth-oriented mindset.&nbsp;What you know matters. But the right mindset is just as important in determining success. We&rsquo;re looking for people who are innovative, can work in an agile way and keep pace with a rapidly changing world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are curious and purpose driven.&nbsp;We&rsquo;re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are inclusive.&nbsp;We&rsquo;re looking for people who seek out and embrace diverse perspectives, who value differences, and team inclusively to build safety and trust.&nbsp;&nbsp;&nbsp;<br />&nbsp; &nbsp;</p>\r\n<p>Qualifications<br />o&nbsp;&nbsp;College freshman,&nbsp;sophomore&nbsp;or junior status&nbsp;<br />o&nbsp;&nbsp;An excellent academic record in Accounting, Computer Information Systems, Management Information Systems, Finance,&nbsp;Economics&nbsp;or a related subject&nbsp;<br />o&nbsp;&nbsp;Strong preference for membership in organizations committed to racial diversity and inclusiveness such as NABA or ALPFA&nbsp;<br />o&nbsp;&nbsp;A proven history of leadership, such as in a campus club or society&nbsp;<br />o&nbsp;&nbsp;A genuine interest in a professional services career&nbsp;<br />o&nbsp;&nbsp;A driver&rsquo;s license valid in the U.S.<br />&nbsp;<br />What&rsquo;s in it for you &nbsp;<br />Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.&nbsp;<br />Broaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds &mdash; both professionally and culturally.&nbsp;<br />Bring out the best in yourself with continuous investment in your personal well-being and career development.&nbsp;<br />Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society &ndash; building a better working world, together.&nbsp;<br />If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;</p>\r\n<p><br />What you can expect&nbsp;<br />Our approach to hiring utilizes several different formats throughout the course of the recruiting process.&nbsp;<br />In addition to speaking with our recruiters and client-serving professionals, we also leverage game-based assessments to assess your non-technical skills and attributes in a quick and engaging experience. This includes your collaboration style and your abilities to work with information and the use of pre-recorded video interviews (PRVI). PRVI technology provides a great opportunity for you to share more about your qualifications and interests, as well as to ask more specifics about EY and the role for which you are interviewing. It also provides you with the flexibility and convenience of completing at a time and place that works best for your schedule.&nbsp;<br />Additional interviews may be in the form of a live interview, either via video or in-person.&nbsp;<br />&nbsp;<br />EY complies with all local laws and regulations. Applicants for jobs in our offices in Colorado, Connecticut and Nevada can find more information here.&nbsp;<br />&nbsp;<br />What we offer&nbsp;<br />If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;<br />&nbsp;<br />Continuous learning: You&rsquo;ll develop the mindset and skills to navigate whatever comes next.&nbsp;<br />Success as defined by you: We&rsquo;ll provide the tools and flexibility, so you can make a meaningful impact, your way.&nbsp;<br />Transformative leadership: We&rsquo;ll give you the insights, coaching and confidence to be the leader the world needs.&nbsp;<br />Diverse and inclusive culture: You&rsquo;ll be embraced for who you are and empowered to use your voice to help others find theirs.&nbsp;<br />&nbsp;<br />If you can demonstrate that you meet the criteria above, please apply here:&nbsp;https://eyglobal.yello.co/jobs/_ciP5N_GG_NtSsfRuHTfuw?job_board_id=c1riT--B2O-KySgYWsZO1Q<br />&nbsp;<br />The exceptional EY experience. It&rsquo;s yours to build.&nbsp;<br />&nbsp;<br />EY | Building a better working world&nbsp;<br />EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.&nbsp;<br />&nbsp;<br />EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.&nbsp;</p>\r\n<p><br />EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY&rsquo;s Talent Shared Services Team or email SSC Customer Support at Customer Support.</p>",
            "visual_id": "46500",
            "job_title": "EY - Launch Intern - Summer 2022",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-04-18T00:00:00-04:00",
                "job_end": "2022-04-27T23:59:59-04:00"
            },
            "postdate": "Apr 18, 2022",
            "deadline": "Apr 27, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/e07/e0757c3eb0ae13adb66e642cc20c57a8.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T054232Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=7fb0e23e415b1a10184a7a97ed4f5a8e12fd01b29fc913361637f365246a8175",
            "favorite": false
        },
        {
            "job_id": "2618a3a8c469d442261494d4dd050834",
            "name": "NOPI - Nonprofit Incubator",
            "blind_flag": 0,
            "job_desc": "<p>The Fiscal Sponsorship Program Liaison (FSPL) carries out the administration and management of application, onboarding, support requests, and program assistance for projects that are fiscally sponsored by NOPI Inc.</p>\r\n<p>This role reports to the Executive Director (E) and coordinates work across Finance, HR, and Technical Assistance. The Liaison tracks support requests via email, voicemail, Slack, and Asana while routing internal support needs to appropriate resources.</p>\r\n<p>The Liaison supports development and finance staff in processing incoming grants, gifts paperwork, grant applications, managing data on grants and gifts, and coordinating appointments in staff calendars. The FSPL manages fiscal sponsor accounts by meeting with fiscal sponsor representatives, tracking grants activities in calendar, Google Sheets, HubSpot, and Instrumental, while providing customer service and support.</p>",
            "visual_id": "51373",
            "job_title": "Program Liaison",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-04-01T00:00:00-04:00",
                "job_end": "2022-06-24T23:59:59-04:00"
            },
            "postdate": "Apr 01, 2022",
            "deadline": "Jun 24, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/86a/86ae8f98ccd3d0297a4a60949829fa1d.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T060950Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=b2f629297bbe6ca1667bc4e6557c25c9bd4890b381ccdb9256af67de206b2359",
            "favorite": false
        },
        {
            "job_id": "d3b9bd1bc29607a9f92f8eb8e6ac0312",
            "name": "Juna Financial Solutions",
            "blind_flag": 0,
            "job_desc": "<p>At Juna you will enjoy a positive, collaborative work environment where contributions are valued, achievements are celebrated, and work/life balance is a priority. This is a Part Time or Full Time entirely remote, non-exempt&nbsp;position that allows for a flexible schedule during business hours.</p>\r\n<p>Juna&nbsp;Accounting Associates&nbsp;work as part of our awesome team to provide accurate and timely financial information to our clients using cutting-edge technologies.</p>\r\n<p>Are you:</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Independent and pro-active</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Tech savvy, adept at technology and accounting software</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Curious and have a love for learning</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A true team player</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Able to thrive in a fast-paced environment, handling multiple clients</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Excited to be part of a growing company</p>\r\n<p>If the answer is yes, please read on!</p>\r\n<p>Responsibilities&nbsp;vary by client and include:</p>\r\n<p>&middot; A/R, A/P, payroll, and financial reporting using cloud-based technologies including QBO, Bill.com, Expensify and others.</p>\r\n<p>&middot; New client implementations</p>\r\n<p>&middot; Managing client relationships to provide concierge level service</p>\r\n<p>&middot; Keeping abreast of the latest developments in accounting technology</p>\r\n<p>&middot; Participating in team and one-on-one meetings and training to ensure your success</p>\r\n<p>Required Qualifications</p>\r\n<p>Bachelor&rsquo;s degree in accounting or business</p>\r\n<p>Minimum of 2 years of accounting experience</p>\r\n<p>Aptitude to learn and adopt new technology</p>\r\n<p>Work well independently and as part of a team</p>\r\n<p>Ability to manage multiple clients and responsibilities</p>",
            "visual_id": "54242",
            "job_title": "Accounting Associate -Remote",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-24T00:00:00-04:00",
                "job_end": "2023-03-24T23:59:59-04:00"
            },
            "postdate": "Mar 24, 2022",
            "deadline": "Mar 24, 2023",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/fe9/fe93d79a89fa68f24bb5b7a67a89bcf6.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T141635Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=d4ab1bf7e5e548685b81d6ecdfe3fd9ee31e12a9602c6d4917303c696ba65749",
            "favorite": false
        },
        {
            "job_id": "c6e788c44306d8859847a076c800c39c",
            "name": "CohnReznick LLP",
            "blind_flag": 0,
            "job_desc": "<p>After applying through NUworks,<strong> students must ALSO apply online through CohnReznick's website</strong>. You must apply through<strong> both portals</strong> in order to be considered for candidacy.</p>\r\n<p><a href=\"https://cohnreznick.tal.net/vx/appcentre-ext/brand-4/candidate/so/pm/1/pl/2/opp/4598-2022-Transactions-Turnaround-Advisory-VAS-PFC-Co-op/en-GB\" target=\"_blank\" rel=\"noopener\">Apply on Website</a></p>\r\n<p>If the above link doesn't work, copy this URL into your browser:</p>\r\n<p><a href=\"https://cohnreznick.tal.net/vx/appcentre-ext/brand-4/candidate/so/pm/1/pl/2/opp/4598-2022-Transactions-Turnaround-Advisory-VAS-PFC-Co-op/en-GB\" target=\"_blank\" rel=\"noopener\">https://cohnreznick.tal.net/vx/appcentre-ext/brand-4/candidate/so/pm/1/pl/2/opp/4599-2022-Transactions-Turnaround-Advisory-TAS-RDR-Co-op/en-GB</a></p>\r\n<p></p>\r\n<p>CohnReznick currently has an exciting career opportunity for an internship within our Transactions and Turnaround Advisory practice. This role will collaborate on thought-provoking, meaningful projects while rotating through two of our four different service lines over the course of your time (July 2022 &ndash; December 2022) at the firm. The program is designed to provide exposure to the firm&rsquo;s activities while receiving coaching in the targeted areas of valuations and financial modeling from accomplished colleagues who have wide-ranging academic, professional, and personal backgrounds.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>If you are:</strong></p>\r\n<ul>\r\n<li>A highly dedicated professional with impressive credentials and driven by new challenges and growth opportunities</li>\r\n<li>A team player who believes in providing world-class client service and interested in becoming immersed in various industries</li>\r\n<li>Looking for a work environment that values and promotes camaraderie, collaboration and giving back to the community<br />&nbsp;</li>\r\n</ul>\r\n<p><strong>Look ahead. Imagine more. And consider joining the CohnReznick team.</strong></p>\r\n<p>&nbsp;</p>\r\n<p><strong>We offer:&nbsp;</strong></p>\r\n<ul>\r\n<li>Endless opportunities to contribute to one of the largest professional services firm in the US</li>\r\n<li>A unique culture that values collaboration in everything we do</li>\r\n<li>A team of professionals driven by a sense of excellence, integrity, commitment to lifelong learning, respect for one another, adaptability, and making a difference</li>\r\n<li>A network of 2,700 professionals committed to a diverse and inclusive workplace and giving back to the communities in which we live and work</li>\r\n<li>Varied career paths supported by strong professional development programs and resources</li>\r\n<li>A flexible work environment with competitive benefits</li>\r\n<li>A unique opportunity to gain experience in various departments and industries, working on real engagements from start to finish.<br />&nbsp;</li>\r\n</ul>\r\n<p><strong>The service lines:</strong></p>\r\n<p><strong>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Valuation Advisory Services</strong></p>\r\n<ul>\r\n<li>Financial reporting / intangible assets</li>\r\n<li>Tax related</li>\r\n<li>Transaction related</li>\r\n<li>Real estate and tangible asset</li>\r\n<li>Complex financial instruments</li>\r\n<li>Litigation dispute<strong></strong></li>\r\n</ul>\r\n<p><strong>Project Finance &amp; Consulting</strong></p>\r\n<ul>\r\n<li>Optimal financing structure</li>\r\n<li>Innovative financial modeling</li>\r\n<li>Transaction value creation</li>\r\n<li>Tax credit strategies</li>\r\n</ul>\r\n<p><strong>Role:</strong></p>\r\n<ul>\r\n<li>Valuation Advisory Services:Work on valuation engagements, including valuations for financial reporting, tax, and transactions;<br />\r\n<ul>\r\n<li>Explore and learn about the valuation issues in different industries for closely held businesses and public companies, commercial real estate, machinery &amp; equipment, renewable energy systems, and partnership interests in real estate;</li>\r\n<li>Perform market, industry, and economic research and analyses;</li>\r\n<li>Assist in the preparation of valuation reports, schedules, and discounted cash flow models;</li>\r\n<li>Review and summarize financial, corporate, and legal agreements;</li>\r\n<li>Conduct financial statement&nbsp;analysis (e.g., common size analysis, ratio analysis, trend analysis, and industry comparative analysis);</li>\r\n<li>Review commercial real estate property information and collection of data using public records and other real estate databases;</li>\r\n</ul>\r\n</li>\r\n<li>Project Finance and Consulting:<br />&nbsp;</li>\r\n</ul>\r\n<p><strong>REQUIREMENTS:</strong></p>\r\n<ul>\r\n<li>Bachelor&rsquo;s or Master&rsquo;s degree in Accounting, Finance or Related Field</li>\r\n<li>CPA or other relevant professional certifications preferred</li>\r\n<li>Minimum GPA of 3.0 in both your major and overall</li>\r\n<li>Leadership positions in extracurricular activities are looked favorably upon, as well as work and internship experience</li>\r\n<li>Excellent communication skills and the ability to work in a team environment</li>\r\n<li>Ability to learn in a fast-paced environment</li>\r\n<li>General computer literacy and proficiency in Microsoft Office (Excel, Word, PowerPoint)</li>\r\n<li>Ability to work additional hours as needed and travel out-of-town to clients as required</li>\r\n<li><strong>Job may be performed remotely&nbsp;</strong><br />&nbsp;</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p><strong>Learn more:</strong></p>\r\n<p>www.cohnreznick.com &nbsp;</p>\r\n<p><br />Connect with us:&nbsp;</p>\r\n<p>www.linkedin.com/company/cohnreznick-llp&nbsp;&nbsp;</p>\r\n<p>www.facebook.com/cohnreznick&nbsp;&nbsp;&nbsp;</p>\r\n<p>www.twitter.com/cr_careers&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>CohnReznick is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, clients, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability.&nbsp; For more information, please see Equal Employment Opportunity Posters</p>\r\n<p></p>\r\n<p>Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities</p>\r\n<p>&nbsp;</p>\r\n<p>Employment is subject to verification of pre-screening tests, which may include background check and credit check</p>\r\n<p>&nbsp;</p>\r\n<p>If you are an individual with a disability in need of assistance at any time during our recruitment process, please contact us at&nbsp;CRaccommodation@cohnreznick.com&nbsp;Please note: This email address is reserved for individuals with disabilities in need of assistance and are not a means of inquiry about positions or application statuses</p>",
            "visual_id": "53499",
            "job_title": "2022 Transactions & Turnaround Advisory- VAS/ PFC (Co-op)",
            "ocr_flag": 0,
            "job_type": [
                "Co-op"
            ],
            "symp_remote_job": 0,
            "qualified": "Not Qualified",
            "jobs_iso_times": {
                "job_start": "2022-03-16T00:00:00-04:00",
                "job_end": "2022-06-01T23:59:59-04:00"
            },
            "postdate": "Mar 16, 2022",
            "deadline": "Jun 01, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Multiple Locations",
            "employer_logo": "",
            "favorite": false
        },
        {
            "job_id": "5f391813e2f44ba751a0bf8be3cd6b77",
            "name": "Internships Down Under ",
            "blind_flag": 0,
            "job_desc": "<p><strong>Group&nbsp;Co-op Program in Sydney, Australia</strong>&nbsp;&nbsp;<br /><br />&nbsp;<br /><br /><strong>Program Description</strong><br /><br /><br /><br />Northeastern is offering,&nbsp;for the first time,&nbsp;a new exciting way of thinking about global co-ops.&nbsp;&nbsp;&nbsp;The cohort co-op program offers a&nbsp;powerful&nbsp;combination of experiential&nbsp;education&nbsp;in a group setting. Celebrate your&nbsp;unique professional experience abroad with the support of your Husky friends.&nbsp;<br /><br />&nbsp;<br /><br /><em><strong>For program details and application process see below - application deadline extended to April 30, 2022.</strong></em><br /><br /><br /><br /><strong>Benefits to&nbsp;students</strong><br /><br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Cohort model: travel, live and work&nbsp;abroad&nbsp;with other students</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Interdisciplinary: share professional experiences in global work environments&nbsp;with peers from other colleges&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Inclusive: planning details will be managed by a local provider and&nbsp;established&nbsp;Northeastern partner (Internships Down Under)</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Financial support for the program will be available from various NU sources&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<p><br /><strong>Why Sydney?&nbsp;</strong><br /><br />&nbsp;<br /><br />Sydney is Australia's largest and most famous city.&nbsp; Think of the World Heritage-listed Sydney Opera House and its ingenious shape and the impressive steel arch of the Harbour Bridge.&nbsp; The blue waters of the harbor and the white sands and curling waves of Bondi Beach will also come to mind.&nbsp; These beautiful images inspire people from all over the world to visit Sydney.&nbsp; This beautiful, cosmopolitan city celebrates its cultural diversity and heritage, and passion for arts and sports. (www.sydney.com)<br /><br />&nbsp;<br /><br />&nbsp;<br /><br /><strong>Examples past placements and roles&nbsp;<br /><br />&nbsp;</strong><br /><br /><a href=\"https://www.todaesolar.com.au/\" target=\"_blank\" rel=\"noopener\">Todae Solar</a>&nbsp;- Engineering<br /><br />Founded in 2003, Todae Solar is Australia-owned #1 commercial and industrial solar EPC with strong local-knowledge and experience.&nbsp; Our company ethos is rooted in sustainability which has been recognized by the City of Sydney and NSW Government with awards.&nbsp; It takes an innovative team to achieve this success and our employees are front and center.&nbsp; Together we work hard, we laugh a lot, we collaborate non-stop and we support each other.<br /><br />&nbsp;<br /><br /><a href=\"https://all.accor.com/gb/city/hotels-sydney-v5577.shtml\" target=\"_blank\" rel=\"noopener\">Accor Hotels</a> - Marketing, finance, media &amp; communications, social entrepreneurship<br /><br />We are far more than a worldwide leader.&nbsp; We are 280,000 hospitality experts placing people in the heart of what we do and nurturing real passion for service and achievements beyond limits.&nbsp; We take care of millions of guests in our 4,900 addresses.<br /><br />&nbsp;<br /><br /><a href=\"https://www.stoneandchalk.com.au/\" target=\"_blank\" rel=\"noopener\">Stone &amp; Chalk</a>&nbsp;- Computer Science<br /><br />Stone and Chalk first opened its doors in 2015 as the only dedicated fintech hub in Australia.&nbsp; Today, we are focused on the industries of tomorrow, as the proliferation of new innovation pours into everything from insurance to agriculture, science to space.&nbsp; We have a vibrant community made up of startups, banks, corporates, regulators mentors and investors who all come together to create a melting of opportunity achieved through the perfect mix of innovation and collaboration.<br /><br /><br /><br /><a href=\"https://www.ktf.ngo/\" target=\"_blank\" rel=\"noopener\">Kokoda Track Foundation</a>&nbsp; &nbsp;Human rights, gender studies, international affairs<br /><br />Our purpose: \"we work with people and communities to improve the lives and futures of Papua New Guineans. We do this by assisting remote and rural communities with access to elementary and primary education, improving access to quality and accessible healthcare, improving livelihoods and access to sustainable income-generation opportunities, especially for women and by fostering the next generation of leaders\"<br /><br />&nbsp;<br /><br /><a href=\"https://eastsidefm.org/\" target=\"_blank\" rel=\"noopener\">Eastside FM Radio</a>&nbsp;- journalism, communications, music<br /><br />Eastside Radio is a community radio system based in Paddington, Sydney, and broadcasting to the eastern suburbs and the greater Sydney area, where it can heard as far west as the Blue Mountains.<br /><br />&nbsp;<br /><br /><a href=\"https://www.unsw.edu.au/\" target=\"_blank\" rel=\"noopener\">UNSW Research</a>&nbsp;- Environmental and conservation field research<br /><br />The University of New South Wales is one of Australia's leading research and teaching universities. At UNSW we take pride of the broad range and high quality of our teaching programs.&nbsp; Our research activities, strong industry links and our international nature, along with our regional and global engagement gives strength and currency to our research activities.<br /><br />&nbsp;<br /><br /><a href=\"https://education.nsw.gov.au/\" target=\"_blank\" rel=\"noopener\">NSW Department of Education</a>&nbsp;- Nursing and health sciences<br /><br />Under the many services of NSW Department of Education is the Wellbeing Framework that supports schools to create learning environments that enable students to be healthy, happy, engaged and successful.&nbsp; The Framework includes a variety of health organizations.<br /><br />&nbsp;<br /><br />Note 1:<em>&nbsp; due to local employment laws these co-ops are unpaid</em><br /><br /><em>Note 2: Student interviews with employers will be arranged by the agency partner (Internships Down Under) only.</em><br /><br />&nbsp;<br /><br /><strong>About Internships Down Under</strong><br /><br />&nbsp;<br /><br />A Northeastern partner,&nbsp;<a href=\"https://www.internshipsdownunder.com/extra-services/welcome-week/\" target=\"_blank\" rel=\"noopener\">Internships Down Under</a>, became the new operating name of Sydney Internships in 2013. First established in 2004 to provide a comprehensive service to international students wanting to complete an internship in Sydney, their services has expanded over the years to include all major cities throughout Australia.&nbsp; The Northeastern progam will operate only in Sydney at this time.<br /><br /><br /><br /><strong>Cost &nbsp;and Living Expenses<br /><br /><br /><br />Start Date&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Duration&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Fee &nbsp; &nbsp;(</strong><strong><em>1USD=1.46AUD)</em></strong><strong> &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong><br /><br />July 2022&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 24 weeks&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;$1650 AUD approx. $1205&nbsp; &nbsp;&nbsp;<br /><br /><br /><br /><strong>Fee inclusions</strong><br /><br />&nbsp;<br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Your professional co-op</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Airport Transfer Return</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Insurance (12 weeks) (additional +$20 per week) $50 Pre-Paid Public Transport Card</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Pre-Departure Information</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Arrival orientation</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Social meetings</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Regular internship check-in</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li>\r\n<ul>\r\n<li>Ongoing support throughout program facilitator University/College Requirements</li>\r\n</ul>\r\n</li>\r\n</ul>\r\n<p><br /><br /><br /><br /><strong>Housing Accommodations&nbsp;</strong><br /><br />&nbsp;<br /><br /><strong>Option 1-Homestay</strong> (1USD=1.46AUD) - Meals and Internet included - Cost per week<br /><br /><br />2 meals Mon - Fri / 3 meals Weekends (Traditional) $320<br />1 meal (Dinner) x 7 days $295<br />No Meals&nbsp; $250<br />3 meals x 7 days $350<br /><br /><br /><strong>Option 2 - Furnished Accommodation</strong> (1USD=1.46AUD) - &nbsp;&nbsp;No meals - Cost per week<br /><br />&nbsp;<br />Property: Forest Lodge<br />Summary: King/twin rooms with shared bathroom and kitchen<br />Max Occupancy: 2<br />Rates: $500 per room/per week<br /><br /><br />Property: Jack`s Place<br />Summary: Single rooms with shared bathroom and kitchen&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Max Occupancy: 1&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Rates: $380 per room/per week<br /><br /><br />Property: Railway Studios<br />Summary: King/twin bed studio with kitchenette and ensuite bathroom. The room also counts with air conditioner, dining table, sofa&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Max Occupancy: 2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Rates: $590 per room/per week<br /><br /><br />Property: Wentworth Park<br />Summary: 2 bedroom apartment with a fully equipped kitchen, air conditioner, internal laundry, dishwasher<br />Max Occupancy: 4<br />Rates: $1,170 per room/per week<br /><br /><strong>Northeastern and External Funding</strong><br /><br /><a href=\"https://studentfinance.northeastern.edu/applying-for-aid/undergraduate/types-of-aid/scholarships/presidential-global-scholars-program/\" target=\"_blank\" rel=\"noopener\"></a></p>\r\n<p><a href=\"https://studentfinance.northeastern.edu/applying-for-aid/undergraduate/types-of-aid/scholarships/presidential-global-scholars-program/\" target=\"_blank\" rel=\"noopener\">Presidential Global Scholarship</a><br /><br /><a href=\"https://undergraduate.northeastern.edu/research/\" target=\"_blank\" rel=\"noopener\">Office of Undergraduate Research and Fellowships</a>&nbsp;(research co-ops)<br /><br /><a href=\"https://www.northeastern.edu/geo/studyabroad/finances/scholarships/\" target=\"_blank\" rel=\"noopener\">Global Experience Office</a><br /><br /><a href=\"https://careers.northeastern.edu/\" target=\"_blank\" rel=\"noopener\">Employer Engagement and Career Design</a></p>\r\n<p><br /><strong>Events &amp; Cultural Immersion&nbsp;</strong><br /><br />&nbsp;<br /><br />A full calendar of social and cultural events will be planned throughout the internship. Events have different costs, please review on agency website.<br /><br /></p>\r\n<ul>\r\n<li>\r\n<ul>\r\n<li><a href=\"https://www.internshipsdownunder.com/extra-services/weekend-trips/\" target=\"_blank\" rel=\"noopener\">Weekend Trips</a></li>\r\n</ul>\r\n</li>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li><a href=\"https://www.internshipsdownunder.com/extra-services/social-meetings/\" target=\"_blank\" rel=\"noopener\">Social Meetings</a></li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li><a href=\"https://www.internshipsdownunder.com/extra-services/welcome-week/\" target=\"_blank\" rel=\"noopener\">Welcome Week Sydney</a></li>\r\n</ul>\r\n</ul>\r\n<p><br /><strong>Pre-departure Orientation&nbsp;</strong><br /><br />&nbsp;<br /><br />1. One month prior to their internship start date, interns are provided with information on the following<br /><br /></p>\r\n<ul>\r\n<li>Welcome adventure week (optional)</li>\r\n<li>Tips from previous interns</li>\r\n<li>Confirmation of internship details</li>\r\n<li>Information for the first day &amp; what to expect</li>\r\n<li>Intern WhatsApp Group links</li>\r\n<li>Medical information &amp; procedure</li>\r\n<li>Budgeting information</li>\r\n<li>Essential phone numbers</li>\r\n<li>Public transport information</li>\r\n<li>General safety tips&nbsp;</li>\r\n</ul>\r\n<p></p>\r\n<p>2<strong>. </strong>Additionally, a group pre-departure orientation session via Skype will be organized and attended by Northeastern staff.&nbsp; All students accepted to Internships Down Under will have to attend.<br /><br />&nbsp;<br /><br /><strong>On-the-ground Orientation </strong><br /><br />&nbsp;<br /><br />The above is reinforced in a face to face orientation meeting. Host companies are guided through an induction checklist which they must take the interns through on their first day.<br /><br /><br /><strong>Emergency Assistance&nbsp;</strong><br /><br /><br />Please see our&nbsp;Health, Safety and Emergency Support site for further information. Available through your Co-op Coordinator.<br /><br />&nbsp;<br /><br /><strong>Application Process</strong><br /><br />Students interested in the program should submit their resume to Aspa Papanastasiou at EECD for initial screening a.papanastasiou@northeastern.edu</p>\r\n<ul>\r\n<li>Students are advised to apply for the Presidential&nbsp;Global Scholarship&nbsp;immediately</li>\r\n<li>Once accepted to the program, students will be referred to IDU for intake and employment placement</li>\r\n<li>Student completes the intake and pays the program deposit</li>\r\n<li>Students interview with posted employers or similar<br />Agency confirms student placement and provides necessary documentation&nbsp;</li>\r\n<li>Student accepts offered position and pays program fee&nbsp;<br />IDU staff coordinates visa guidance with NU Global Experience Office&nbsp;&nbsp;</li>\r\n<li>IDU suggest recommended arrival dates in conjunction with EECD&nbsp;</li>\r\n<li>Students book flights to Sydney</li>\r\n<li>Students attend pre-departure orientation with agency and Northeastern staff&nbsp;</li>\r\n<li>Students attend on-the-ground orientation in Dublin<br />Students continue to check in IDU until the end of their co-op<br />&nbsp;</li>\r\n</ul>\r\n<ol>\r\n<li>\r\n<ol></ol>\r\n</li>\r\n</ol>\r\n<ol>\r\n<ol></ol>\r\n</ol>\r\n<p><br /><br /><strong>Program Details&nbsp;</strong><br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>The starting and end dates of this&nbsp;group co-op program&nbsp;are set&nbsp;&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Once you accept a position&nbsp;you make a&nbsp;commitment to this program&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>All&nbsp;inclusives&nbsp;are part of the program cost&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Your participation to the Pre-Departure Orientation and On-the-Ground Orientation is mandatory&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Your participation to the cultural events is recommended but optional</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>All placements abroad are unpaid due to visa regulations&nbsp;&nbsp;&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<p><br /><br /><strong>Student Testimonials</strong><br /><br /><br />Anna \"It was a wonderful experience with the opportunity to not only learn new things but also to meet a lot of new and really nice people.\"<br /><br />You may find more testimonials on agency website.<br /><br /><br /><strong>Where you can find more information&nbsp;</strong><br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Your Co-op Coordinator&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Aspa Papanastasiou @ EECD&nbsp;</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul></ul>\r\n</ul>\r\n<p></p>",
            "visual_id": "52641",
            "job_title": "Group Global Co-op - Sydney, Australia",
            "ocr_flag": 0,
            "job_type": [
                "Co-op"
            ],
            "symp_remote_job": 0,
            "qualified": "Not Qualified",
            "jobs_iso_times": {
                "job_start": "2022-03-07T00:00:00-05:00",
                "job_end": "2022-04-30T23:59:59-04:00"
            },
            "postdate": "Mar 07, 2022",
            "deadline": "Apr 30, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Sydney, New South Wales, Australia",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/c0b/c0bb53d77a9890b73f17a9773c032475.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T060602Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=a4027704ea12f4f35ad5c2af1a6d940b2a897ef7dd21cafe5f32808f8f596606",
            "favorite": false
        },
        {
            "job_id": "c4b1123ddc1ecd1f7f005e6f55f10f78",
            "name": "BDO USA, LLP",
            "blind_flag": 0,
            "job_desc": "<p>BDO&rsquo;s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.</p>\r\n<p>As an intern in our Forensic Data Science practice, you will begin to utilize your educational background as well as your organizational skills as you serve the firm's dynamic client base. The intern&rsquo;s responsibilities include problem solving, consulting, and fact-finding on active cases as well as internal practice initiatives (e.g., business development and service offering innovation). In this role, you will have the opportunity to gain an understanding of the business by working on various stages of a forensic consulting engagement across issues like bribery and corruption, fraud, money laundering, disputes, litigation, corporate compliance, and data breach response. On these engagements, you will work side-by-side with more experienced team members who can provide you with direction, coaching, and learning opportunities.<br />Qualifications</p>\r\n<p>Education:<br />- Currently pursuing a Bachelor&rsquo;s or Master&rsquo;s degree, required<br />- Currently pursuing a degree with focus in Accounting, Analytics, Computer Science, Statistics, Economics, Engineering, or Information Systems, preferred</p>\r\n<p>Experience:<br />- Leadership experience, preferred</p>\r\n<p>Software:<br />- Understanding of relational databases, preferably SQL Server, preferred<br />- Experience with Python, R, and/or other programming languages or tools, preferred<br />- Experience with data profiling, analytic, and management tools, preferred<br />- Experience with data visualization software (e.g., Tableau, PowerBI), preferred<br />- Proficient in Microsoft Office Suite, Word, Excel, and PowerPoint, preferred</p>\r\n<p>Other Knowledge, Skills &amp; Abilities:<br />- Ability to work with a high degree of professionalism and autonomy<br />- Willingness to learn and develop skills in these programs<br />- Excellent verbal and written communication skills<br />- Ability to communicate complex information in a clear and concise manner<br />- Solid organizational skills, especially the ability to meet project deadlines with a focus on details<br />- Ability to work in a deadline-driven environment<br />- Ability to interact effectively with people at all organizational levels of the Firm<br />- Ability to work collaboratively with others with accountability for work product<br />Multiple Locations</p>\r\n<p>Atlanta, Boston, Chicago, Dallas, Greater Washington D.C - Potomac, Greater Washington D.C. - McLean, Houston, Los Angeles, New York</p>",
            "visual_id": "51544",
            "job_title": "Forensic Data Science Intern - Summer 2022",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-25T00:00:00-05:00",
                "job_end": "2022-05-13T23:59:59-04:00"
            },
            "postdate": "Feb 25, 2022",
            "deadline": "May 13, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Multiple Locations",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/b69/b69e8945d5056ed177afe292d4653d94.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T121809Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=422534dc983159931abd7a1fa5bdadd92b3daadbb5a44c50d37fbb35be4030fa",
            "favorite": false
        },
        {
            "job_id": "d356b9368a590f04d85a0e0b59c70840",
            "name": "BDO USA, LLP",
            "blind_flag": 0,
            "job_desc": "<p>BDO&rsquo;s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.</p>\r\n<p>As an Associate in our Forensic Data Science practice, you will begin to utilize your educational background as well as your organizational skills as you serve the firm's dynamic client base. An Associate&rsquo;s responsibilities include problem solving, consulting, and fact-finding on active cases as well as internal practice initiatives (e.g. recruiting, business development, and service offering innovation). You will have the opportunity to gain an understanding of the business by working on various stages of a forensic consulting engagement across issues like bribery and corruption, fraud, money laundering, disputes, litigation, corporate compliance, and data breach response. On these engagements, you will work side-by-side with more experienced team members who can provide you with direction, coaching, and learning opportunities.</p>\r\n<p>Qualifications</p>\r\n<p><strong>Education:</strong></p>\r\n<p>Bachelor&rsquo;s degree, required; focus in Accounting, Analytics, Computer Science, Statistics, Economics, Engineering, or Information Systems, preferred</p>\r\n<p><strong>Experience</strong>:</p>\r\n<p>Leadership experience, preferred</p>\r\n<p><strong>Software:</strong></p>\r\n<ul>\r\n<li>Understanding of relational databases, preferably SQL Server</li>\r\n<li>Experience with Python, R, and/or other programming languages or tools, preferred</li>\r\n<li>Experience with data profiling, analytic, and management tools, preferred</li>\r\n<li>Experience with data visualization software (e.g. Tableau, PowerBI), preferred</li>\r\n<li>Proficient in Microsoft Office Suite, Word, Excel, and PowerPoint, preferred</li>\r\n<li>Willingness to learn and develop skills in these programs</li>\r\n</ul>\r\n<p><strong>Other Knowledge, Skills &amp; Abilities:</strong></p>\r\n<ul>\r\n<li>Ability to work with a high degree of professionalism and autonomy</li>\r\n<li>Excellent verbal and written communication skills</li>\r\n<li>Ability to communicate complex information in a clear and concise manner</li>\r\n<li>Solid organizational skills, especially the ability to meet project deadlines with a focus on details</li>\r\n<li>Ability to work in a deadline-driven environment</li>\r\n<li>Ability to interact effectively with people at all organizational levels of the Firm</li>\r\n<li>Ability to work collaboratively with others with accountability for work product<br /><strong></strong></li>\r\n</ul>\r\n<p><strong>Multiple Locations</strong></p>\r\n<p>Boston, Chicago, Dallas, Greater Washington D.C - Potomac, Greater Washington D.C.</p>\r\n<p>McLean, Houston, Los Angeles, New York, San Francisco, Washington, DC</p>",
            "visual_id": "51545",
            "job_title": "Forensic Data Science Associate - Summer/Fall 2022",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-25T00:00:00-05:00",
                "job_end": "2022-06-17T23:59:59-04:00"
            },
            "postdate": "Feb 25, 2022",
            "deadline": "Jun 17, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Multiple Locations",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/b69/b69e8945d5056ed177afe292d4653d94.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T121809Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=422534dc983159931abd7a1fa5bdadd92b3daadbb5a44c50d37fbb35be4030fa",
            "favorite": false
        },
        {
            "job_id": "28e7f6e6b2d2034110c7235c35470d52",
            "name": "Meaden & Moore, LLP",
            "blind_flag": 0,
            "job_desc": "<p>Firm:<br />Meaden &amp; Moore is a leading CPA and business consulting firm that is a five- time winner of The Plain Dealer's Top Workplaces, and a four-time winner of Ohio Magazine's Best Places to Work who is committed to providing outstanding professional services for our clients, rewarding careers for our staff, and diligent service to our communities.&nbsp;Since 1919, we have focused our expertise and resources on providing superior accounting, tax, forensic, and consulting services to a wide array of clients in a variety of industries.&nbsp;Through careful examination of the issues affecting business success, our CPAs, CFEs, CFFs, advisors, and auditors develop strategies and solutions to help our clients thrive in today&rsquo;s global economy.&nbsp;</p>\r\n<p><br />Opportunity and Qualifications:<br />We are currently seeking a Forensic Staff Accountant.<br />&nbsp;<br />The majority of&nbsp;our&nbsp;engagements involve working with commercial property insurers in evaluating physical damage and business income losses suffered by businesses resulting from catastrophes.&nbsp;Projects may include reviewing and analyzing historical financial and industry information, revenue and expense projections, insurance claim evaluations and economic damage evaluations. Assignments provide exposure to a wide range of industries from small local retail stores to multinational entities.&nbsp;<br />&nbsp;<br />We are looking for individuals who seek exciting, long-term career challenges in the field of accounting and have a genuine interest in the area of forensic accounting and litigation support services.&nbsp;Successful individuals in this field are naturally outgoing, self-motivated, possess strong communication and analytical skills, and enjoy a wide variety of work experiences and challenges.&nbsp;</p>\r\n<p><br />To be considered for this position, candidates must:&nbsp;<br />&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hold a Bachelor or advanced degree in Accounting or Finance<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Have an active CPA license (or be actively pursuing their CPA designation)<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Possess intermediate-level Microsoft Excel and Word skill<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Travel overnight, as needed (approximately less than 10%).<br />&nbsp;</p>\r\n<p><br />Our Commitment to Diversity and Inclusion:<br />Our human capital is the most valuable asset we have. The collective sum of the individual differences, life experiences, knowledge, inventiveness, innovation, self-expression, unique capabilities and talent that our employees invest in their work represents a significant part of not only our culture, but our reputation and company&rsquo;s achievement as well.</p>\r\n<p><br />We embrace and encourage our employees&rsquo; differences in age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other characteristics that make our employees unique.</p>\r\n<p><br />Benefits/Compensation:<br />Meaden &amp; Moore provides a competitive compensation package commensurate with qualifications and experience, in addition to a unique incentive program that rewards our exemplary employees.&nbsp;We also offer a comprehensive benefits package that includes your choice of medical programs, generous PTO, 401k, and various bonus opportunities.</p>",
            "visual_id": "49943",
            "job_title": "Forensic Staff Accountant",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-11T00:00:00-05:00",
                "job_end": "2022-05-20T23:59:59-04:00"
            },
            "postdate": "Feb 11, 2022",
            "deadline": "May 20, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/7f8/7f8b89ba2db3516d7b81c7cbb0849891.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T070226Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=6313a01f6899ab76930bb297c1e983699ae4960dc34e61e8600af03b46b27a98",
            "favorite": false
        },
        {
            "job_id": "b005879be82b7edc1e8a4c2b1fbe10eb",
            "name": "Internships Down Under ",
            "blind_flag": 0,
            "job_desc": "<p>&nbsp;<br /><br /><strong>About</strong><br /><br />Internships Down Under, a Northeastern partner, &nbsp;has been arranging traditional in-person internships for International students travelling to Australia for over 15 years. Although this continues to be a major part of our operations, we acknowledge that the global workplace landscape is rapidly changing and internships need to reflect the changing workplace environments to prepare students accordingly. Virtual Internships develop an entirely new set of skills to that of an in-person internship.<br /><br /><br /><strong>Remote Fall 2022 Postings </strong><br /><br />In response to the current global health crisis and subsequent travel bans, Internships Down Under is offering Northeastern students remote opportunities for fall 2021. The information below describes programs offered with select employers in a variety of locations.&nbsp;<br /><br /><br /><strong>Remote Internship Program Benefits</strong><br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Significantly more cost effective (no flights, visas, insurance, etc)</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Flexible location</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Flexible hours</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Continue studying at their local University alongside the internship</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Reference provided on successful completion</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>No limitations associated with the Visa</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Course credit may be available</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Develop digital management &amp; online international communication skills</li>\r\n</ul>\r\n</ul>\r\n<p><br /><strong>Industries</strong><br /><br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Marketing and Online Marketing</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Social Media and Journalism</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Engineering</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Finance and Accounting</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Event Management and Tourism</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Public Relations</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Public Relations and Communications</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Graphic Design and Web Design</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Fashion and Film</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Human Resources</li>\r\n</ul>\r\n</ul>\r\n<p><br /><br /><strong>Duration, Program Fees and Deposits</strong><br /><br />We have developed two convenient options available for Virtual Internships;<br /><br /><br /><br />8 Weeks &gt; 20 hours per week; Total 160 hours of Virtual practical experience<br /><br />12 Weeks &gt; 20 hours per week; Total 240 hours of Virtual practical experience<br /><br /><br /><br />Both options include at least 1 x weekly voice or video call with the company supervisor.<br /><br />At this stage we remain open to accommodating requests for an alternative duration.<br /><br />Please contact us to request a tailored program to meet the requirements of your clients/students<br /><br />&nbsp;<br /><br /><strong>Program Fee and Inclusions</strong><br /><br /><br /><br />690 AUS (approx.. $445)<br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Match to a professional virtual co-op</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Virtual Tour - Sydney</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Orientation to Australian Culture</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Weekly virtual call between host company and &nbsp;student participants</li>\r\n</ul>\r\n</ul>\r\n<p><br /><strong>What are the requirements?</strong><br /><br /><br />What are you asking as minimum requirements ? GPA, experience, languages, etc.<br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Strong English level</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Reliable internet reception</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Basic skills &amp;/or experience in your chosen industry</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Flexibility to fit in with the company's business hours for online calls</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Familiar with online communication and project management platforms</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Self motivated</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Prompt response to the company's questions</li>\r\n</ul>\r\n</ul>\r\n<p></p>\r\n<p><strong>For Northeastern students - Financial Aid</strong>&nbsp;</p>\r\n<p>The fee and relevant costs for this experience can be covered by the Presidential Global Scholarship.&nbsp; If the proposed experience is a research co-op, then you can also apply for research funding through the Office of Undergraduate Research and Fellowships.</p>\r\n<p>Links for both the offices are below:</p>\r\n<p>https://studentfinance.northeastern.edu/applying-for-aid/undergraduate/types-of-aid/scholarships/presidential-global-scholarship/&nbsp;</p>\r\n<p>https://undergraduate.northeastern.edu/research/&nbsp;</p>\r\n<p>&nbsp;<br /><br /><strong>Application Process</strong><br /><br /><br /></p>\r\n<ul>\r\n<ul>\r\n<li>Indicate interest for this agency in NUcareers</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Your resume will be sent to Robbie Sekel</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Complete agency online application and send resume and one reference letter</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<ul>\r\n<li>Next step: a Skype interview with agency contact for Northeastern</li>\r\n</ul>\r\n</ul>\r\n<p><br /><br />&nbsp;<br /><br /><strong>Student Testimonials</strong><br /><br />Student experiences through Internships Down Under can be viewed here<br /><br /><a href=\"https://www.youtube.com/playlist?list=PL4qI34l9cgDDkTXUDNlqI1a7LkNxX9mo8\" target=\"_blank\" rel=\"noopener\">https://www.youtube.com/playlist?list=PL4qI34l9cgDDkTXUDNlqI1a7LkNxX9mo8</a><br /><br />&nbsp;</p>",
            "visual_id": "48473",
            "job_title": "Remote Co-ops Australia -",
            "ocr_flag": 0,
            "job_type": [
                "Co-op"
            ],
            "symp_remote_job": 0,
            "qualified": "Not Qualified",
            "jobs_iso_times": {
                "job_start": "2022-02-03T00:00:00-05:00",
                "job_end": "2022-06-15T23:59:59-04:00"
            },
            "postdate": "Feb 03, 2022",
            "deadline": "Jun 15, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Sydney, Australia",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/c0b/c0bb53d77a9890b73f17a9773c032475.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T060602Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=a4027704ea12f4f35ad5c2af1a6d940b2a897ef7dd21cafe5f32808f8f596606",
            "favorite": false
        },
        {
            "job_id": "e7a3b1380c6f64cf356fc2013b91a234",
            "name": "E.J. Callahan & Associates",
            "blind_flag": 0,
            "job_desc": "<p>E.J. Callahan &amp; Associates Company Description</p>\r\n<p>&nbsp;</p>\r\n<p>Teamwork. Focus. Passion.</p>\r\n<p></p>\r\n<p>This is a four month co-op - September - December</p>\r\n<p>&nbsp;</p>\r\n<p>Ranked one of the 50 fastest growing companies in Massachusetts by the Boston Business Journal for 3 consecutive years, E. J. Callahan &amp; Associates is a CPA firm that serves as business advisor, accountant and consultant to Boston&rsquo;s construction, real-estate, manufacturing, professional services and non-profit industries. We have a passion for partnering with our clients to help them achieve and sustain success.</p>\r\n<p>&nbsp;</p>\r\n<p>Roles at EJC are dynamic in nature as team members work in both audit and tax on businesses small and large in a variety of industries. We value working as a team to achieve the highest results for our clients through strategic business planning, financial reporting and analysis, income tax planning, forecasting, benchmarking, contract evaluation, merger and acquisition and succession planning. Our small business and start-up sectors are growing rapidly as we provide bookkeeping, information system set up and business advisory services to entrepreneurs who are looking to further their impact.</p>\r\n<p>&nbsp;</p>\r\n<p>At EJC, we place an emphasis on professional development and advancement through our mentor, student loan payoff and tuition reimbursement programs. We believe the key to success is continuous learning.&nbsp;</p>\r\n<p></p>\r\n<p>Candidate&rsquo;s responsibilities include:</p>\r\n<p><br />AUDIT:<br />Understanding client&rsquo;s needs and expectations, their business and industry, accounting and control systems, employees, company values and industry-related GAAP and GAAS issues<br />Developing an understanding of the EJC audit approach and tools<br />Performing substantive tests and tests of internal controls to identify and resolve accounting or reporting issues<br />Drafting financial statements under prescribed formats</p>\r\n<p><br />TAX:<br />Completing tax planning and research<br />Preparing federal and state &amp; local tax returns<br />Understanding tax regulations and accounting pronouncements<br />Basic Qualifications:<br />90 Credit hours completed<br />Working towards B.A / B.S. degree or equivalent from an accredited university<br />Accounting Major<br />Travel to assigned client locations is required. Must have access to and ability to arrange for use of reliable transportation to those locations<br />A minimum 3.0 GPA is preferred</p>\r\n<p>Work schedule is hybrid.&nbsp;</p>\r\n<p></p>\r\n<p>Covid-19 Protocols: Masks are required for unvaccinated individuals and optional for vaccinated individuals. Client protocols are followed when on client sites.</p>\r\n<p></p>\r\n<p>Schedule:</p>\r\n<ul>\r\n<li>Monday to Friday</li>\r\n</ul>\r\n<p>Ability to Commute/Relocate:</p>\r\n<ul>\r\n<li>Wakefield, MA 01880 (Required)</li>\r\n</ul>",
            "visual_id": "48355",
            "job_title": "Audit / Tax Coop (hybrid) - Fall 2022",
            "ocr_flag": 0,
            "job_type": [
                "Co-op"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-03T00:00:00-05:00",
                "job_end": "2022-08-22T23:59:59-04:00"
            },
            "postdate": "Feb 03, 2022",
            "deadline": "Aug 22, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Wakefield, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/cbe/cbe52ccb3e2179c0374cb8177cae418d.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T123646Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=2ba9a47a1b558c15af6d1c704bbf71554ab54e8370c5b5eecd89d31635db260f",
            "favorite": false
        },
        {
            "job_id": "9ebcbe1e7396519acdcf9805defc5287",
            "name": "E.J. Callahan & Associates",
            "blind_flag": 0,
            "job_desc": "<p><strong>E.J. Callahan &amp; Associates Company Description:</strong></p>\r\n<p>Teamwork. Focus. Passion.</p>\r\n<p>Ranked one of the 50 fastest growing companies in Massachusetts by the Boston Business Journal for 3 consecutive years, E. J. Callahan &amp; Associates is a CPA firm that serves as business advisor, accountant and consultant to Boston&rsquo;s construction, real-estate, manufacturing, professional services and non-profit industries. We have a passion for partnering with our clients to help them achieve and sustain success.&nbsp;</p>\r\n<p>Roles at EJC are dynamic in nature as team members work in both audit and tax on businesses small and large in a variety of industries. We value working as a team to achieve the highest results for our clients through strategic business planning, financial reporting and analysis, income tax planning, forecasting, benchmarking, contract evaluation, merger and acquisition and succession planning. Our small business and start-up sectors are growing rapidly as we provide bookkeeping, information system set up and business advisory services to entrepreneurs who are looking to further their impact.</p>\r\n<p>At EJC, we place an emphasis on professional development and advancement through our mentor, student loan payoff and tuition reimbursement programs. We believe the key to success is continuous learning.&nbsp;</p>\r\n<p>Senior Audit Associate</p>\r\n<p><strong>Qualifications:</strong></p>\r\n<ul>\r\n<li>Bachelor's (Required)</li>\r\n<li>Accounting: 3 years (Required)</li>\r\n<li>US work authorization (Required)</li>\r\n<li>CPA (Preferred)</li>\r\n</ul>\r\n<p>Our next dynamic Audit Senior would be responsible for:</p>\r\n<ul>\r\n<li>Perform and help manage client audits, reviews, and compilations across a range of industries.</li>\r\n<li>Prepare, analyze and communicate financial statements and management reporting.</li>\r\n<li>Work directly with tax team to prepare tax filings and communicate effective tax planning strategies.</li>\r\n<li>Assist with team coordination of engagement planning, fieldwork and close meetings.</li>\r\n<li>Work directly with clients in response to inquiries and develop strong relationships with client personnel.</li>\r\n<li>Audit Seniors will also be responsible for mentoring and directing multiple staff members.</li>\r\n</ul>\r\n<p>Experience and Education Requirements:</p>\r\n<ul>\r\n<li>Bachelors degree in Accounting or Finance.</li>\r\n<li>CPA or CPA in progress.</li>\r\n<li>3+ years of experience in public accounting</li>\r\n<li>Demonstrated teamwork and leadership qualities.</li>\r\n<li>Excellent written and verbal communication skills.</li>\r\n<li>Strong analytical, organizational, and project management skills.&nbsp;</li>\r\n</ul>\r\n<p>Preferred Experience:</p>\r\n<ul>\r\n<li>Previous construction industry finance or accounting experience</li>\r\n<li>Knowledge of CCH Axcess and ProSystem FX preferred but not required.</li>\r\n</ul>\r\n<p>Work schedule is hybrid.</p>\r\n<p>Covid-19 Protocols: Unvaccinated individuals are required to wear a mask in office. Masks are optional for vaccinated individuals. EJC follows client protocols on client sites.&nbsp;</p>\r\n<p><strong>Benefits</strong>:</p>\r\n<ul>\r\n<li>401(k)</li>\r\n<li>401(k) matching</li>\r\n<li>Dental insurance</li>\r\n<li>Disability insurance</li>\r\n<li>Flexible schedule</li>\r\n<li>Health insurance</li>\r\n<li>Life insurance</li>\r\n<li>Paid time off</li>\r\n<li>Professional development assistance</li>\r\n<li>Referral program</li>\r\n<li>Retirement plan</li>\r\n<li>Student loan repayment assistance</li>\r\n<li>Supervisory bonus plan</li>\r\n<li>Tuition reimbursement program (MBA/MST/MSA)</li>\r\n<li>Vision insurance</li>\r\n</ul>\r\n<p><strong>Schedule:</strong></p>\r\n<ul>\r\n<li>Monday to Friday</li>\r\n</ul>\r\n<p><strong>Ability to Commute/Relocate:</strong></p>\r\n<ul>\r\n<li>Wakefield, MA 01880 (Required)</li>\r\n</ul>",
            "visual_id": "48353",
            "job_title": "Senior Audit Associate (Hybrid) - Fall 2022",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-03T00:00:00-05:00",
                "job_end": "2022-08-22T23:59:59-04:00"
            },
            "postdate": "Feb 03, 2022",
            "deadline": "Aug 22, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Wakefield, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/cbe/cbe52ccb3e2179c0374cb8177cae418d.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T123646Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=2ba9a47a1b558c15af6d1c704bbf71554ab54e8370c5b5eecd89d31635db260f",
            "favorite": false
        },
        {
            "job_id": "638fd53954bffeb4bf53133b2643ce86",
            "name": "E.J. Callahan & Associates",
            "blind_flag": 0,
            "job_desc": "<p>E.J. Callahan &amp; Associates Company Description</p>\r\n<p>&nbsp;</p>\r\n<p>Teamwork. Focus. Passion.</p>\r\n<p>&nbsp;</p>\r\n<p>Ranked one of the 50 fastest growing companies in Massachusetts by the Boston Business Journal for 3 consecutive years, E. J. Callahan &amp; Associates is a CPA firm that serves as business advisor, accountant and consultant to Boston&rsquo;s construction, real-estate, manufacturing, professional services and non-profit industries. We have a passion for partnering with our clients to help them achieve and sustain success.</p>\r\n<p>&nbsp;</p>\r\n<p>Roles at EJC are dynamic in nature as team members work in both audit and tax on businesses small and large in a variety of industries. We value working as a team to achieve the highest results for our clients through strategic business planning, financial reporting and analysis, income tax planning, forecasting, benchmarking, contract evaluation, merger and acquisition and succession planning. Our small business and start-up sectors are growing rapidly as we provide bookkeeping, information system set up and business advisory services to entrepreneurs who are looking to further their impact.</p>\r\n<p>&nbsp;</p>\r\n<p>At EJC, we place an emphasis on professional development and advancement through our mentor, student loan payoff and tuition reimbursement programs. We believe the key to success is continuous learning.&nbsp;</p>\r\n<p></p>\r\n<p>Senior Tax Associate</p>\r\n<p>&nbsp;</p>\r\n<p>Qualifications</p>\r\n<ul>\r\n<li>Bachelor's (Required)</li>\r\n<li>Accounting: 3 years (Required)</li>\r\n<li>US work authorization (Required)</li>\r\n<li>CPA (Preferred)</li>\r\n</ul>\r\n<p></p>\r\n<p>As part of our Tax Team, the Senior Associate's responsibilities would include:</p>\r\n<ul>\r\n<li>Perform and help manage client audits, reviews, and compilations across a range of industries.</li>\r\n<li>Prepare, analyze, and communicate financial statements and management reporting.</li>\r\n<li>Work directly with the tax team to prepare tax filings and communicate effective tax planning strategies.</li>\r\n<li>Assist with team coordination of engagement planning, fieldwork, and close meetings.</li>\r\n<li>Work directly with clients in response to inquiries and develop strong relationships with client personnel.</li>\r\n<li>Mentor and direct multiple staff members depending on experience level</li>\r\n</ul>\r\n<p></p>\r\n<p>Role requirements include:</p>\r\n<ul>\r\n<li>Bachelor's degree in Accounting or Finance.</li>\r\n<li>CPA or CPA in progress.</li>\r\n<li>3+ years of experience in public accounting.</li>\r\n<li>Demonstrated teamwork and leadership qualities.</li>\r\n<li>Excellent written and verbal communication skills.</li>\r\n<li>Strong analytical, organizational, and project management skills.</li>\r\n<li>Knowledge of CCH Axcess and ProSystem FX preferred but not required.</li>\r\n</ul>\r\n<p>,</p>\r\n<p>Work schedule is hybrid.&nbsp;</p>\r\n<p>Covid-19 Protocol: Masks are required for unvaccinated individuals and option for vaccinated individuals. Staff follows client protocols when on client sites.</p>\r\n<p></p>\r\n<p>Benefits:</p>\r\n<ul>\r\n<li>401(k)</li>\r\n<li>401(k) matching</li>\r\n<li>Dental insurance</li>\r\n<li>Disability insurance</li>\r\n<li>Flexible schedule</li>\r\n<li>Health insurance</li>\r\n<li>Life insurance</li>\r\n<li>Paid time off</li>\r\n<li>Professional development assistance</li>\r\n<li>Referral program</li>\r\n<li>Retirement plan</li>\r\n<li>Student loan repayment assistance</li>\r\n<li>Supervisory bonus plan</li>\r\n<li>Tuition reimbursement program (MBA/MST/MSA)</li>\r\n<li>Vision insurance</li>\r\n</ul>\r\n<p>Schedule:</p>\r\n<ul>\r\n<li>Monday to Friday</li>\r\n</ul>\r\n<p>Ability to Commute/Relocate:</p>\r\n<ul>\r\n<li>Wakefield, MA 01880 (Required)</li>\r\n</ul>",
            "visual_id": "48354",
            "job_title": "Senior Tax Associate (Hybrid) - Fall 2022",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-03T00:00:00-05:00",
                "job_end": "2022-08-22T23:59:59-04:00"
            },
            "postdate": "Feb 03, 2022",
            "deadline": "Aug 22, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Wakefield, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/cbe/cbe52ccb3e2179c0374cb8177cae418d.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T123646Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=2ba9a47a1b558c15af6d1c704bbf71554ab54e8370c5b5eecd89d31635db260f",
            "favorite": false
        },
        {
            "job_id": "255bc47e0894d5332150f0d68d4b1d03",
            "name": "Grassi & Co.",
            "blind_flag": 0,
            "job_desc": "<p>As the 64th largest accounting firm in the nation, Grassi is a leading provider of advisory, tax and accounting services to businesses and individuals. Grassi advisors specialize in providing industry-specific business consulting, audit, tax, and technology services to key market sectors, including construction, architecture and engineering, not-for-profit, healthcare, manufacturing and distribution, financial services, real estate, cannabis and more. With offices in New York, Jericho, Ronkonkoma and White Plains, NY; Park Ridge, NJ; Palm Beach, FL; and Needham, MA, the firm has the depth of knowledge and experience to work effectively alongside clients across the Northeast and throughout the United States, as well as internationally through its membership in Moore Global.<br />&nbsp;<br />Interns are part-time employees who are interested in pursuing a career in professional services. Interns will assist teams in any necessary work. During this time, the intern will focus on developing skills, building their technical knowledge, understanding and executing diligent client service, and getting oriented to the Firm&rsquo;s practices, policies, and culture. Work is performed under close supervision. Responsibilities increase with demonstrated skill.<br />&nbsp;<br /><strong>Internship Program:</strong><br /><strong>&nbsp;</strong><br />All Interns start as a team from their first day, and bond as a unified group. During the first week, the Intern class will go through a comprehensive training and professional education program. This program is designed to ensure that the Intern has all the tools necessary to perform their day-to-day duties, as well as the ability to gain knowledge that will be transferrable in any future position they may hold. Everyone will receive a &ldquo;buddy&rdquo; whose main purpose is to answer any questions and guarantee the Intern adapts to their new responsibilities and environment as quickly and seamlessly as possible.<br />&nbsp;<br /><strong>What we are looking for:</strong><br /><strong>&nbsp;</strong><br />&middot;Proactively demonstrates a willingness to learn and attain greater knowledge on a continual basis; looks to build technical skill base and seek additional work.<br />&middot;Conducts oneself professionally and demonstrates respect to others at all times.<br />&middot;Maintains poise under pressure, especially during stressful times and during peak periods of client engagement activity.<br />&middot;Cooperative and responsive to training, supervision and constructive criticism and proactively meets with Peer Buddy.<br />&nbsp;<br /><strong>Candidates must possess the following:</strong><br />&nbsp;<br />&middot; Junior or Senior students, graduating within the next 12 &ndash; 18 months.<br />&middot; Anticipated Bachelor&rsquo;s degree in Accounting with 150 credits or Master's degree in Accounting<br />with a minimum grade point average of 3.0.<br />&middot; Strong interpersonal, organizational, initiative and leadership skills.<br />&middot; Ability to work independently as well as within a team environment.<br />&middot; Actively working towards CPA licensure.<br />&middot; We do not sponsor or transfer work visas.</p>",
            "visual_id": "48284",
            "job_title": "Tax Internship - January 2023",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-02T00:00:00-05:00",
                "job_end": "2022-10-03T23:59:59-04:00"
            },
            "postdate": "Feb 02, 2022",
            "deadline": "Oct 03, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Needham, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/eca/eca0bff00f3d1be6d1375b468199458c.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T123143Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=ecde4c14974a9490471c4fa70687c0223f587550685a3e43ddd1cba01ed526aa",
            "favorite": false
        },
        {
            "job_id": "967a7b5e7a5d82b5ad877c67420822d0",
            "name": "Grassi & Co.",
            "blind_flag": 0,
            "job_desc": "<p>As the 64th largest accounting firm in the nation, Grassi is a leading provider of advisory, tax and accounting services to businesses and individuals. Grassi advisors specialize in providing industry-specific business consulting, audit, tax, and technology services to key market sectors, including construction, architecture and engineering, not-for-profit, healthcare, manufacturing and distribution, financial services, real estate, cannabis and more. With offices in New York, Jericho, Ronkonkoma and White Plains, NY; Park Ridge, NJ; Palm Beach, FL; and Needham, MA, the firm has the depth of knowledge and experience to work effectively alongside clients across the Northeast and throughout the United States, as well as internationally through its membership in Moore Global.</p>\r\n<p></p>\r\n<p><strong>Overall Summary: </strong></p>\r\n<p>Associates are entry-level employees who are interested in pursuing a career in professional services, in the fields of tax, audit and accounting. Staff will assume responsibility for level appropriate areas of audits, reviews and compilations. In addition, staff will assist in the preparation of corporate, individual and partnerships documents, as well as preparation of corporate, individual, foreign and partnerships tax returns. During this time, the staff will focus on developing skills, building their technical knowledge, understanding and executing diligent client service, and getting oriented to the Firm&rsquo;s practices, policies, and culture. Work is performed under close supervision. Responsibilities increase with demonstrated skill. All Associates start as a team from their first day, and bond as a unified group. During the first few weeks, the Associate class will go through a comprehensive training and professional education program. This program is designed to ensure that the Associate has all the tools necessary to perform their day-to-day duties, as well as the ability to escalate quickly in their career. Everyone will receive a &ldquo;buddy&rdquo; whose main purpose is to answer any questions and guarantee the Associate adapts to their new responsibilities and environment as quickly and seamlessly as possible.</p>\r\n<p></p>\r\n<p><strong>Candidates must possess the following:</strong></p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Anticipated (December 2021 through May 2022) Bachelor&rsquo;s degree in Accounting with 150 credits or Master's degree in Accounting with a minimum grade point average of 3.0.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Strong interpersonal, organizational, initiative and leadership skills.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to work independently as well as within a team environment.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Candidates must be actively working towards passing the CPA exam.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We do not sponsor or transfer work visas.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Job Description:</strong></p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Technical Development</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Grasps concepts quickly and demonstrates knowledge of basic technical skills.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Makes well thought out decisions, asks appropriate questions, and requests supervision when in need of assistance.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Follow all accounting, auditing and tax regulations and professional ethics.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Keep current on all professional pronouncements.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Develops proficiency in use of all technology.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Personnel and Firm Development</strong></p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Seeks opportunities to participate in training, recruiting and retention, with a focus on firm wide and team goals.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Promotes team environment by building and maintaining rapport with fellow employees.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Positively represents and promotes the Firm.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Participates in continuous improvement initiatives that enhance processes and systems.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Client Service and Risk Management</strong></p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Initiates and maintains positive client relationships.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Demonstrates an understanding of the clients&rsquo; industries. Shows sensitivity to client culture and perspective.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Produces deliverables that are clear, concise, thorough, and of professional quality and are completed in a timely manner.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ensures job execution, documentation, consultation and completion in accordance with required policies and procedures.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Begins to search for and communicates ways to improve client satisfaction.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Self-Development</strong></p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Proactively demonstrates a willingness to learn and attain greater knowledge on a continual basis; looks to build technical skill base and seek additional work.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Conducts oneself professionally and demonstrates respect to others at all times.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Maintains poise under pressure, especially during stressful times and during peak periods of client engagement activity.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cooperative and responsive to training, supervision and constructive criticism and proactively meets with Peer Partner.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Actively pursuing CPA licensure.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Financial Growth and Practice Development</strong></p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Meets or exceeds chargeable hour targets.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Punctually enters time and expenses to support efficient billing processes.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Maintains appropriate compliance with all Firm policies and procedures.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Demonstrates willingness to understand how to work within budgetary parameters.</p>\r\n<p>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Begins to build a knowledge base of the different service offerings.</p>\r\n<p>&nbsp;</p>",
            "visual_id": "48265",
            "job_title": "Tax/Audit Associate ",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-02-02T00:00:00-05:00",
                "job_end": "2022-10-03T23:59:59-04:00"
            },
            "postdate": "Feb 02, 2022",
            "deadline": "Oct 03, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Needham, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/eca/eca0bff00f3d1be6d1375b468199458c.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T123143Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=ecde4c14974a9490471c4fa70687c0223f587550685a3e43ddd1cba01ed526aa",
            "favorite": false
        },
        {
            "job_id": "0940ac8935da7f2cab1a44f8178b66ae",
            "name": "Ernst & Young LLP",
            "blind_flag": 0,
            "job_desc": "<p><strong>Assurance &ndash; Audit Intern - Summer 2022</strong><br />&nbsp;<br />At EY, you&rsquo;ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we&rsquo;re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.<br />&nbsp;<br />EY offers a variety of career paths and opportunities, and with so many options, we understand it can be hard to choose. To have the best candidate experience, we encourage you to apply to&nbsp;no more than 2 positions within a 6-month period.</p>\r\n<p><br />To learn more about career opportunities, visit Careers at EY (https://www.ey.com/en_us/careers). Prior to completing your application, please be diligent in reviewing the job description to ensure you meet the qualifications for the position.</p>\r\n<p><br />If we are unable to consider you for this particular position, a recruiter may contact you to gauge your interest in other opportunities at EY.<br />&nbsp;<br /><em>What if your career could have a lasting impact on you, and on the world?</em>&nbsp;<br />Here at EY, you&rsquo;ll have the chance to build a truly exceptional experience. We&rsquo;ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you&rsquo;ll develop the skillsets you need to stay relevant today&nbsp;and in the future&nbsp;&ndash; all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.&nbsp;&nbsp;<br />&nbsp;<br />The exceptional EY experience. It's yours to build.&nbsp;<br />The opportunity: your next adventure awaits.<br />&nbsp;<br />The broad business perspective you get in EY&rsquo;s Assurance practice will serve as a launch pad to your career, whether you stay at EY to partner or seek a role in the C-suite. Our easy-to-use Audit Career Framework will help you map your successful career path, understand just what&rsquo;s expected of you, and access the right learning, experiences and coaching to support your career progression. Along the way, you&rsquo;ll develop a deep understanding of the inner workings of business and draw on your accounting knowledge to help solve complex challenges.&nbsp;&nbsp;<br />&nbsp;<br />You will spend much of your time meeting with our clients directly at their offices, undertaking audit activities to identify and resolve complex issues. When you start with the organization, you can join our audit practice and choose from a variety of industries (Consumer Products, Life Sciences, Industrial Products, Real Estate, Automotive and Transportation, to name a few). You will be given opportunities to work across these industries, which will provide deep knowledge of key drivers for success and risks specific to the industry.<br />&nbsp;<br />And if you know you have a strong desire to work within our Financial Services Organization, which is tailored to banking, insurance, funds or other financial industry companies, you may elect that path as well. Whichever you choose, you&rsquo;ll find no shortage of opportunities to take on new challenges and responsibilities while discovering and developing your strengths and ambitions.&nbsp;<br />&nbsp;<br />Your key responsibilities&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Identifying potential audit issues or unusual relationships in financial statements with detailed analytical trend analysis.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Demonstrating your professionalism while working in clients&rsquo; environments and providing exceptional service.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Operating effectively in a regulated environment, with a focus on protecting the capital markets and the investing public.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Developing and maintaining relationships with our clients to provide definitive auditing services that the capital markets and the client can rely upon.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sharing the story of value-added insights discovered through data analysis with our clients.&nbsp;<br />&nbsp;<br />What we look for&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You have an agile, growth-oriented mindset.&nbsp;What you know matters. But the right mindset is just as important in determining success. We&rsquo;re looking for people who&nbsp;are innovative, can work in an agile way&nbsp;and keep pace with&nbsp;a&nbsp;rapidly changing world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are curious and purpose driven.&nbsp;We&rsquo;re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are inclusive.&nbsp;We&rsquo;re looking for people who seek out and embrace diverse perspectives, who value differences,&nbsp;and team inclusively to build safety and trust.&nbsp;&nbsp;&nbsp;</p>\r\n<p>Qualifications<br />o&nbsp;&nbsp;Have or&nbsp;be working toward, an undergraduate or graduate degree in&nbsp;Accounting&nbsp;&nbsp;<br />o&nbsp;&nbsp;A strong academic record, including, without limitation, course work that EY deems relevant to this position&nbsp;<br />o&nbsp;&nbsp;A demonstrable plan for passing the CPA exam&nbsp;<br />o&nbsp;&nbsp;The ability and willingness to travel and work in excess of standard hours when necessary&nbsp;<br />o&nbsp;&nbsp;A driver&rsquo;s license valid in the U.S.&nbsp;&nbsp;</p>\r\n<p><br />What&rsquo;s in it for you &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Broaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds &mdash; both professionally and culturally. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bring out the best in yourself with continuous investment in your personal well-being and career development. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society &ndash; building a better working world, together. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. &nbsp;<br />&nbsp;<br />What you can expect &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Our approach to hiring utilizes several different formats throughout the course of the recruiting process. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In addition to speaking with our recruiters and client-serving professionals, we also leverage game-based assessments to assess your non-technical skills and attributes in a quick and engaging experience. This includes your collaboration style and your abilities to work with information and the use of pre-recorded video interviews (PRVI). PRVI technology provides a great opportunity for you to share more about your qualifications and interests, as well as to ask more specifics about EY and the role for which you are interviewing. It also provides you with the flexibility and convenience of completing at a time and place that works best for your schedule. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Additional interviews may be in the form of a live interview, either via video or in-person. &nbsp;<br />&nbsp;<br />EY complies with all local laws and regulations. Applicants for jobs in our offices in Colorado, Connecticut and Nevada can find more information here. &nbsp;<br />&nbsp;<br />What we offer <br />If you join EY full-time after your internship, we offer a competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. &nbsp;<br />&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Continuous learning: You&rsquo;ll develop the mindset and skills to navigate whatever comes next. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Success as defined by you: We&rsquo;ll provide the tools and flexibility, so you can make a meaningful impact, your way. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Transformative leadership: We&rsquo;ll give you the insights, coaching and confidence to be the leader the world needs. &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Diverse and inclusive culture: You&rsquo;ll be embraced for who you are and empowered to use your voice to help others find theirs. &nbsp;<br />&nbsp;<br />If you can demonstrate that you meet the criteria above, please apply here as soon as possible:&nbsp;https://eyglobal.yello.co/jobs/S3xbkVERlbRD0GSLVXD_vA?job_board_id=c1riT--B2O-KySgYWsZO1Q<br />&nbsp;<br />The exceptional EY experience. It&rsquo;s yours to build. &nbsp;<br />&nbsp;<br />EY | Building a better working world &nbsp;<br />EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today. &nbsp;<br />&nbsp;<br />EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. &nbsp;<br />&nbsp;<br />EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY&rsquo;s Talent Shared Services Team or email SSC Customer Support at Customer Support</p>",
            "visual_id": "46495",
            "job_title": "EY - Assurance - Audit Intern - Summer 2022",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-01-21T00:00:00-05:00",
                "job_end": "2022-04-27T23:59:59-04:00"
            },
            "postdate": "Jan 21, 2022",
            "deadline": "Apr 27, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/e07/e0757c3eb0ae13adb66e642cc20c57a8.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T054232Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=7fb0e23e415b1a10184a7a97ed4f5a8e12fd01b29fc913361637f365246a8175",
            "favorite": false
        },
        {
            "job_id": "681e0c95bd9eb3a9d7d01df52a7a0325",
            "name": "Ernst & Young LLP",
            "blind_flag": 0,
            "job_desc": "<p>Assurance &ndash; Audit Staff&nbsp;<br />&nbsp;<br />At EY, you&rsquo;ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we&rsquo;re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.</p>\r\n<p><br />EY offers a variety of career paths and opportunities, and with so many options, we understand it can be hard to choose. To have the best candidate experience, we encourage you to apply to&nbsp;no more than 2 positions within a 6-month period.</p>\r\n<p><br />To learn more about career opportunities, visit Careers at EY (https://www.ey.com/en_us/careers). Prior to completing your application, please be diligent in reviewing the job description to ensure you meet the qualifications for the position.</p>\r\n<p><br />If we are unable to consider you for this particular position, a recruiter may contact you to gauge your interest in other opportunities at EY.<br />&nbsp;<br />What if your career could have a lasting impact on you, and on the world?&nbsp;<br />Here at EY, you&rsquo;ll have the chance to build a truly exceptional experience. We&rsquo;ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you&rsquo;ll develop the skillsets you need to stay relevant today&nbsp;and in the future&nbsp;&ndash; all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.&nbsp;&nbsp;</p>\r\n<p><br />Harness our global scale, our tech, our teams and our culture to realize your potential. Learn from the best, surround yourself with the curious, ask better questions to seek better answers and build a better working world. The exceptional EY experience. It&rsquo;s yours to build.</p>\r\n<p><br />The exceptional EY experience. It's yours to build.&nbsp;<br />The opportunity: your next adventure awaits.&nbsp;<br />&nbsp;<br />The broad business perspective you get in EY&rsquo;s Assurance practice will serve as a launch pad to your career, whether you stay at EY to partner or seek a role in the C-suite. Our easy-to-use Audit Career Framework will help you map your successful career path, understand just what&rsquo;s expected of you, and access the right learning, experiences and coaching to support your career progression. Along the way, you&rsquo;ll develop a deep understanding of the inner workings of business and draw on your accounting knowledge to help solve complex challenges.&nbsp;&nbsp;<br />&nbsp;<br />You will spend much of your time meeting with our clients directly at their offices, undertaking audit activities to identify and resolve complex issues. When you start with the organization, you can join our audit practice and choose from a variety of industries (Consumer Products, Life Sciences, Industrial Products, Real Estate, Automotive and Transportation, to name a few). You will be given opportunities to work across these industries, which will provide deep knowledge of key drivers for success and risks specific to the industry. And if you know you have a strong desire to work within our Financial Services Organization, which is tailored to banking, insurance, funds or other financial industry companies, you may elect that path as well. Whichever you choose, you&rsquo;ll find no shortage of opportunities to take on new challenges and responsibilities while discovering and developing your strengths and ambitions.&nbsp;<br />&nbsp;<br /><strong>Your key responsibilities&nbsp;</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Identifying potential audit issues or unusual relationships in financial statements with detailed analytical trend analysis.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Demonstrating your professionalism while working in clients&rsquo; environments and providing exceptional service.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Operating effectively in a regulated environment, with a focus on protecting the capital markets and the investing public.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Developing and maintaining relationships with our clients to provide definitive auditing services that the capital markets and the client can rely upon.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sharing the story of value-added insights discovered through data analysis with our clients.&nbsp;<br />&nbsp;<br /><strong>What we look for&nbsp;&nbsp;</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You have an agile, growth-oriented mindset.&nbsp;What you know matters. But the right mindset is just as important in determining success. We&rsquo;re looking for people who&nbsp;are innovative, can work in an agile way&nbsp;and keep pace with&nbsp;a&nbsp;rapidly changing world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are curious and purpose driven.&nbsp;We&rsquo;re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are inclusive.&nbsp;We&rsquo;re looking for people who seek out and embrace diverse perspectives, who value differences,&nbsp;and team inclusively to build safety and trust.&nbsp;&nbsp;&nbsp;<br />&nbsp; &nbsp;</p>\r\n<p><strong>Qualifications</strong><br />o&nbsp;&nbsp;Have or&nbsp;be working toward, an undergraduate or graduate degree in&nbsp;Accounting&nbsp;&nbsp;<br />o&nbsp;&nbsp;A strong academic record, including, without limitation, course work that EY deems relevant to this position&nbsp;<br />o&nbsp;&nbsp;A demonstrable plan for passing the CPA exam&nbsp;<br />o&nbsp;&nbsp;The ability and willingness to travel and work in excess of standard hours when necessary&nbsp;<br />o&nbsp;&nbsp;A driver&rsquo;s license valid in the U.S.&nbsp;&nbsp;<br />&nbsp;<br /><strong>What&rsquo;s in it for you&nbsp;</strong>&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Broaden your horizons by working on&nbsp;highly&nbsp;integrated&nbsp;teams across the globe&nbsp;and collaborate with people of diverse backgrounds &mdash; both professionally and culturally.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bring out the best in yourself with continuous investment in your personal well-being and career development.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society &ndash; building a better working world, together.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options.&nbsp;Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances.&nbsp;You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;&nbsp;<br />&nbsp;<br /><strong>What you can expect&nbsp;</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Our approach to hiring utilizes several different formats throughout the course of the recruiting process.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In addition to speaking with our recruiters and client-serving professionals, we also leverage game-based assessments to assess your non-technical skills and attributes in a quick and engaging experience. This includes your collaboration style and your abilities to work with information and the use of pre-recorded video interviews (PRVI). PRVI technology provides a great opportunity for you to share more about your qualifications and interests, as well as to ask more specifics about EY and the role for which you are&nbsp;interviewing. It also provides you with the flexibility and convenience of completing at a time and place that works best for your schedule.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Additional interviews may be in the form of a live interview, either via video or in-person.&nbsp;<br />&nbsp;<br />EY complies with all local laws and regulations. Applicants for jobs in our offices in Colorado, Connecticut and Nevada can find more information&nbsp;here.&nbsp;<br />&nbsp;<br />What we offer&nbsp;<br />We offer a competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;<br />&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Continuous learning:&nbsp;You&rsquo;ll develop the mindset and skills to navigate whatever comes next.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Success as defined by you:&nbsp;We&rsquo;ll provide the tools and flexibility, so you can make a meaningful impact, your way.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Transformative leadership:&nbsp;We&rsquo;ll give you the insights, coaching and confidence to be the leader the world needs.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Diverse and inclusive culture:&nbsp;You&rsquo;ll be embraced for who you are and empowered to use your voice to help others find theirs.&nbsp;<br />&nbsp;<br />If you can demonstrate that you meet the criteria above, please apply here:&nbsp;https://eyglobal.yello.co/jobs/37BBDFqpPq4DE2SsNYNrtA?job_board_id=c1riT--B2O-KySgYWsZO1Q<br />&nbsp;<br />The exceptional EY experience. It&rsquo;s yours to build.&nbsp;<br />&nbsp;<br />EY | Building a better working world&nbsp;<br />EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.&nbsp;<br />&nbsp;<br />EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.&nbsp;<br />&nbsp;<br />EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY&rsquo;s Talent Shared Services Team or email SSC Customer Support at Customer Support.</p>",
            "visual_id": "46501",
            "job_title": "EY - Assurance - Audit Staff",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-01-21T00:00:00-05:00",
                "job_end": "2022-04-27T23:59:59-04:00"
            },
            "postdate": "Jan 21, 2022",
            "deadline": "Apr 27, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/e07/e0757c3eb0ae13adb66e642cc20c57a8.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T054232Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=7fb0e23e415b1a10184a7a97ed4f5a8e12fd01b29fc913361637f365246a8175",
            "favorite": false
        },
        {
            "job_id": "7984a453ebd58b37d0979aac2bfee230",
            "name": "Ernst & Young LLP",
            "blind_flag": 0,
            "job_desc": "<p><strong>Consulting &ndash; Enterprise Risk Staff</strong></p>\r\n<p>At EY, you&rsquo;ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we&rsquo;re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.</p>\r\n<p><br />EY offers a variety of career paths and opportunities, and with so many options, we understand it can be hard to choose. To have the best candidate experience, we encourage you to apply to&nbsp;no more than 2 positions within a 6-month period.</p>\r\n<p><br />To learn more about career opportunities, visit Careers at EY (https://www.ey.com/en_us/careers). Prior to completing your application, please be diligent in reviewing the job description to ensure you meet the qualifications for the position.</p>\r\n<p><br />If we are unable to consider you for this particular position, a recruiter may contact you to gauge your interest in other opportunities at EY.<br />&nbsp;<br />What if your career could have a lasting impact on you, and on the world?&nbsp;<br />Here at EY, you&rsquo;ll have the chance to build a truly exceptional experience. We&rsquo;ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you&rsquo;ll develop the skillsets you need to stay relevant today&nbsp;and in the future&nbsp;&ndash; all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.&nbsp;&nbsp;<br />&nbsp;<br />The opportunity: your next adventure awaits.<br />&nbsp;<br />At EY Consulting, we are building a better working world by transforming businesses through the power of people, technology and innovation.&nbsp;Our clients are at the heart of what we do. We&rsquo;re focused on solving the key issues of our client buyers, building deeper relationships and making a greater impact with long-term value.&nbsp;<br />&nbsp;<br />Enterprise Risk is dedicated to helping our clients identify, assess and manage financial, operational, compliance, IT and strategic risks across their enterprise to provide value to their business. As a part of the Enterprise Risk team, you will work&nbsp;hand-in-hand&nbsp;with senior team members to help clients manage their risks (and improve their organizational processes) through designing, establishing and maintaining an effective process, risk and control environment. As a trusted business advisor, EY assists our clients in assessing and responding to risks in both a consulting and assurance context. This dual perspective provides our consultants with an in-depth understanding of a company&rsquo;s strategic priorities, business strategies, business and IT processes, operations, and corresponding risks and controls. We focus on a variety of industries including but not limited to: Advanced Manufacturing &amp; Mobility, Power &amp; Utilities, Health Sciences &amp; Wellness, Consumer, and Technology, Media &amp; Entertainment, Telecommunications.&nbsp;&nbsp;&nbsp;</p>\r\n<p><br />Candidates can elect to join the Government &amp; Public Sector (GPS) practice and will work exclusively with federal clients, as well as state and local agencies and higher education institutions.&nbsp;&nbsp;</p>\r\n<p><br />Candidates can elect to join the Financial Services Organization (FSO) and will focus exclusively&nbsp;in&nbsp;financial services; they will have opportunities to serve leading investment banks, retail and commercial banks, insurers and investment managers.&nbsp;</p>\r\n<p><br />Whether you choose to join GPS, FSO, or pursue a broader industry focus, you will gain foundational skills for a long career in our Consulting practice.&nbsp;<br /><strong>&nbsp;</strong></p>\r\n<p>Your key responsibilities:</p>\r\n<p>Understanding and documenting clients&rsquo; business and IT strategies as well as processes, to identify gaps or issues with risk management and control design elements&nbsp;<br />Helping our clients&rsquo; design and implement risk management and internal control strategies to mitigate strategic, financial, operational and compliance risks&nbsp;<br />Designing and executing tests of controls to support client management&rsquo;s assessment of their internal controls&nbsp;<br />Performing internal audits over specified areas (e.g., strategy, operations, finance, IT) of client businesses and drafting observations for inclusion in reports of findings and recommendations on how to improve processes and better mitigate risk&nbsp;<br />Evaluating and assessing client operations to identify potential issues, performing root cause analysis and providing recommendations for remediation&nbsp;<br />Monitoring and managing project and task status, ensuring key stakeholders are kept informed about progress and expected outcomes&nbsp;<br />Building lasting relationships with our clients and understanding their unique business model, ambitions and problems to allow EY to deliver reliable, tailored support as a trusted business advisor&nbsp;<br />Having a strong focus on developing a reputation as a trusted resource in your area by continuously updating your understanding of current business and industry trends through learning and development opportunities&nbsp;<br />Communicating professionally and effectively, both verbally and written, with supervisors, team members, and client contacts&nbsp;&nbsp;<br />Being accountable for assigned tasks including conducting consistent self-review of work to identify and improve an approach for producing high quality deliverables&nbsp;<br />Engaging with your supervisor to understand and address feedback on work products and incorporating guidance into future performance&nbsp;<br />Self-managing and reporting time and expenses related to project activities and tasks on&nbsp;daily&nbsp;and weekly basis&nbsp;<br />Participate in meetings with key client contacts and stakeholders to discuss consulting&nbsp;project&nbsp;<br />Drafting illustrations of business and IT processes using flow charts, narratives or other technologies&nbsp;<br />Developing controls testing strategy and approach&nbsp;&nbsp;<br />Testing internal controls by reviewing and documenting relevant evidence to conclude on the design and operational effectiveness of controls and the overall control environment&nbsp;<br />Assisting with the following activities in support of internal audit projects: risk assessment(s), audit planning and scoping, execution and documentation of business processes and/or IT systems, and audit reporting&nbsp;<br />Corresponding with client contacts and supervisors to understand key concepts, support and conclusions&nbsp;&nbsp;<br />Drafting components of client deliverables such as audit reports, risks assessments, and quality assessments&nbsp;<br />&nbsp;<br />What we look for:</p>\r\n<p>You have an agile, growth-oriented mindset.&nbsp;What you know matters. But the right mindset is just as important in determining success. We&rsquo;re looking for people who&nbsp;are innovative, can work in an agile way&nbsp;and keep pace with&nbsp;a&nbsp;rapidly changing world.&nbsp;&nbsp;<br />You are curious and purpose driven.&nbsp;We&rsquo;re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.&nbsp;&nbsp;<br />You are inclusive.&nbsp;We&rsquo;re looking for people who seek out and embrace diverse perspectives, who value differences,&nbsp;and team inclusively to build safety and trust.&nbsp;&nbsp;&nbsp;</p>\r\n<p><br />Qualifications:</p>\r\n<p>A bachelor&rsquo;s or master&rsquo;s degree in Accounting or Accounting with an emphasis in Information Systems or Computer Science&nbsp;<br />Desire to work in the areas of risk management, internal controls and/or internal audit as demonstrated by relevant course work, interest or internship experience&nbsp;<br />Proficiency with MS Office, including MS Excel, MS Word, MS PowerPoint, MS Teams, MS Outlook and MS Power Bi&nbsp;<br />Willingness and ability to learn and work both independently with minimal supervision and collaboratively within a team&nbsp;<br />Demonstrated project management, teaming, organizational, analytical and problem-solving skills&nbsp;<br />Excellent interpersonal, written and verbal communication skills&nbsp;<br />Demonstrated ability to develop relationships, both internally and with client stakeholders&nbsp;<br />Effective organization and time management skills with the ability to work under pressure and adhere to project deadlines&nbsp;<br />Integrity within a professional environment&nbsp;<br />The flexibility and willingness to travel as well as work in excess of standard hours when necessary&nbsp;<br />The understanding that travel is an essential function of the job, and may vary by location and can range between 40-60%&nbsp;<br />A driver&rsquo;s license valid in the U.S.&nbsp;<br />Candidates interested in the Government &amp; Public Sector focus must have U.S. citizenship and be able to obtain and maintain a secret clearance or higher, within the designated time frame, which will be determined by the engagement requirements for a security clearance.&nbsp;<br />&nbsp;<br />What&rsquo;s in it for you:</p>\r\n<p>Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.&nbsp;<br />Broaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds &mdash; both professionally and culturally.&nbsp;<br />Bring out the best in yourself with continuous investment in your personal well-being and career development.&nbsp;<br />Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society &ndash; building a better working world, together.&nbsp;<br />We offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;</p>\r\n<p><br />What you can expect:</p>\r\n<p>Our approach to hiring utilizes several different formats throughout the course of the recruiting process.&nbsp;<br />In addition to speaking with our recruiters and client-serving professionals, we also leverage game-based assessments to assess your non-technical skills and attributes in a quick and engaging experience. This includes your collaboration style and your abilities to work with information and the use of pre-recorded video interviews (PRVI). PRVI technology provides a great opportunity for you to share more about your qualifications and interests, as well as to ask more specifics about EY and the role for which you are interviewing. It also provides you with the flexibility and convenience of completing at a time and place that works best for your schedule.&nbsp;<br />Additional interviews may be in the form of a live interview, either via video or in-person.&nbsp;<br />&nbsp;<br />EY complies with all local laws and regulations. Applicants for jobs in our offices in Colorado, Connecticut and Nevada can find more information here.&nbsp;<br />&nbsp;<br />What we offer:</p>\r\n<p>We offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;<br />&nbsp;<br />Continuous learning: You&rsquo;ll develop the mindset and skills to navigate whatever comes next.&nbsp;<br />Success as defined by you: We&rsquo;ll provide the tools and flexibility, so you can make a meaningful impact, your way.&nbsp;<br />Transformative leadership: We&rsquo;ll give you the insights, coaching and confidence to be the leader the world needs.&nbsp;<br />Diverse and inclusive culture: You&rsquo;ll be embraced for who you are and empowered to use your voice to help others find theirs.&nbsp;<br />&nbsp;<br />If you can demonstrate that you meet the criteria above, please apply here as soon as possible:&nbsp;<a href=\"https://eyglobal.yello.co/jobs/xqlft2aZzc5AO2kAaEvR5A?job_board_id=c1riT--B2O-KySgYWsZO1Q\" target=\"_blank\" rel=\"noopener\">https://eyglobal.yello.co/jobs/xqlft2aZzc5AO2kAaEvR5A?job_board_id=c1riT--B2O-KySgYWsZO1Q</a><br />&nbsp;<br />The exceptional EY experience. It&rsquo;s yours to build.&nbsp;<br />&nbsp;<br />EY | Building a better working world&nbsp;<br />EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.&nbsp;<br />&nbsp;<br />EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.&nbsp;</p>\r\n<p><br />EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY&rsquo;s Talent Shared Services Team or email SSC Customer Support at Customer Support.</p>",
            "visual_id": "46496",
            "job_title": "EY - Consulting - Enterprise Risk Staff",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-01-21T00:00:00-05:00",
                "job_end": "2022-04-27T23:59:59-04:00"
            },
            "postdate": "Jan 21, 2022",
            "deadline": "Apr 27, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/e07/e0757c3eb0ae13adb66e642cc20c57a8.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T054232Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=7fb0e23e415b1a10184a7a97ed4f5a8e12fd01b29fc913361637f365246a8175",
            "favorite": false
        },
        {
            "job_id": "d3206501e41e7a9fa07c7d7c32bb4f30",
            "name": "Ernst & Young LLP",
            "blind_flag": 0,
            "job_desc": "<p>Consulting - Technology Risk&nbsp;Intern&nbsp;&ndash;&nbsp;Summer 2022<br />&nbsp;<br />At EY, you&rsquo;ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we&rsquo;re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.</p>\r\n<p><br />EY offers a variety of career paths and opportunities, and with so many options, we understand it can be hard to choose. To have the best candidate experience, we encourage you to apply to&nbsp;no more than 2 positions within a 6-month period.</p>\r\n<p><br />To learn more about career opportunities, visit Careers at EY (https://www.ey.com/en_us/careers). Prior to completing your application, please be diligent in reviewing the job description to ensure you meet the qualifications for the position.</p>\r\n<p><br />If we are unable to consider you for this particular position, a recruiter may contact you to gauge your interest in other opportunities at EY.<br />&nbsp;<br />What if your career could have a lasting impact on you, and on the world?&nbsp;<br />Here at EY, you&rsquo;ll have the chance to build a truly exceptional experience. We&rsquo;ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you&rsquo;ll develop the skillsets you need to stay relevant today&nbsp;and in the future&nbsp;&ndash; all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.&nbsp;&nbsp;<br />&nbsp;<br />The exceptional EY experience. It's yours to build.&nbsp;<br />The opportunity: your next adventure awaits.<br />&nbsp;<br />At EY Consulting, we are building a better working world by transforming businesses through the power of people, technology and innovation. Our clients are at the heart of what we do. We&rsquo;re focused on solving the key issues of our client buyers, building deeper relationships and making a greater impact with long-term value.&nbsp;Specifically, within our Technology Risk track, you will help clients in employing proper information systems, resources, and controls to maximize efficiencies and minimize risk. You can expect to work with your clients to analyze, evaluate, and enhance information systems controls facilitating the Company&rsquo;s business processes.&nbsp;<br />&nbsp;<br />We focus on a variety of industries including but not limited to:&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Advanced Manufacturing &amp; Mobility, Power &amp; Utilities, Health Sciences &amp; Wellness, Consumer, and Technology, Media &amp; Entertainment, Telecommunications.&nbsp;You&nbsp;will have exposure to clients in a variety of these industries.&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Candidates can elect to join the Government &amp; Public Sector (GPS) practice and will work exclusively with federal clients, as well as state and local agencies and higher education institutions.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Candidates can elect to join the Financial Services Organization (FSO) and will focus exclusively&nbsp;on&nbsp;financial services; they will have opportunities to serve leading investment banks, retail and commercial banks, insurers and investment managers.&nbsp;<br />&nbsp;<br />Whether you choose to join GPS, FSO, or pursue a broader industry focus, you will gain foundational skills for a long career.&nbsp;<br />&nbsp;<br />Your key responsibilities&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Growing lasting relationships with our clients and understanding their unique ambitions and needs to deliver reliable, tailored advice&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Understanding and documenting clients&rsquo; business and IT processes, risks, and controls&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Performing control documentation and testing through review of client evidence and interviews&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Using knowledge of the current IT environment to identify the engagement and client service issues, perform root cause analysis, and communicate this information to the engagement team through written correspondence and verbal presentations &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Collaborating with members of the engagement team to plan the engagement and develop work program timelines, assign responsibilities for key tasks and prepare other planning documents &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Taking full responsibility for tasks including consistent self-review of work to identify and improve an approach for producing high quality deliverables, while working under supervision&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assisting team management with project planning, documenting audit walkthrough and testing results, as well as finalizing client deliverables&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Monitoring and managing project progress and risks, and ensuring key stakeholders are kept informed about progress and expected outcomes&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Coordinating with clients to obtain and review necessary engagement artifacts&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Creating flowcharts and process documentation for financially relevant processes&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Documenting and testing controls, as well as reviewing evidence provided by the client&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Performing common work assignments and projects including, but not limited to: System and Organization Controls (&ldquo;SOC&rdquo;) reports, third-party risk assessments, IT risk and control framework design and assessments of automated and IT General Controls (ITGCs) as part of SOX and Financial Statement audits&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Developing executive presentations to update key stakeholders on project status&nbsp;<br />&nbsp;<br />What we look for&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You have an agile, growth-oriented mindset.&nbsp;What you know matters. But the right mindset is just as important in determining success. We&rsquo;re looking for people who are innovative, can work in an agile way and keep pace with a rapidly changing world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are curious and purpose driven.&nbsp;We&rsquo;re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are inclusive.&nbsp;We&rsquo;re looking for people who seek out and embrace diverse perspectives, who value differences, and team inclusively to build safety and trust.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Qualifications<br />o&nbsp;&nbsp;A bachelor&rsquo;s or master&rsquo;s degree in Accounting, Information Systems, Computer Science, Finance or Management&nbsp;or a related discipline&nbsp;<br />o&nbsp;&nbsp;Desire to work in consulting and IT audit as demonstrated by relevant course work, interest or internship experience&nbsp;<br />o&nbsp;&nbsp;Proficiency with MS Office, including MS Excel, MS Word and MS PowerPoint&nbsp;<br />o&nbsp;&nbsp;Willingness and ability to learn and work independently with minimal supervision&nbsp;<br />o&nbsp;&nbsp;Demonstrate project management, teaming, organizational, analytical and problem-solving skills&nbsp;<br />o&nbsp;&nbsp;Excellent interpersonal, written and verbal communication skills&nbsp;<br />o&nbsp;&nbsp;Effective organization and time management skills with the ability to work under pressure and adhere to project deadlines&nbsp;<br />o&nbsp;&nbsp;Integrity within a professional environment&nbsp;<br />o&nbsp;&nbsp;The flexibility and willingness to travel as well as work in excess of standard hours when necessary&nbsp;<br />o&nbsp;&nbsp;The understanding that travel is an essential function of the job, may vary by location and can range between 60-80%&nbsp;<br />o&nbsp;&nbsp;A driver&rsquo;s license valid in the U.S.&nbsp;<br />o&nbsp;&nbsp;Candidates interested in the Government &amp; Public Sector focus must have U.S. citizenship and be able to obtain and maintain a secret clearance or higher, within the designated time frame, which will be determined by the engagement requirements for a security clearance.&nbsp;&nbsp;&nbsp;<br />&nbsp;<br />What&rsquo;s in it for you &nbsp;<br />Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.&nbsp;<br />Broaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds &mdash; both professionally and culturally.&nbsp;<br />Bring out the best in yourself with continuous investment in your personal well-being and career development.&nbsp;<br />Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society &ndash; building a better working world, together.&nbsp;<br />If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;</p>\r\n<p><br />What you can expect&nbsp;<br />Our approach to hiring utilizes several different formats throughout the course of the recruiting process.&nbsp;<br />In addition to speaking with our recruiters and client-serving professionals, we also leverage game-based assessments to assess your non-technical skills and attributes in a quick and engaging experience. This includes your collaboration style and your abilities to work with information and the use of pre-recorded video interviews (PRVI). PRVI technology provides a great opportunity for you to share more about your qualifications and interests, as well as to ask more specifics about EY and the role for which you are interviewing. It also provides you with the flexibility and convenience of completing at a time and place that works best for your schedule.&nbsp;<br />Additional interviews may be in the form of a live interview, either via video or in-person.&nbsp;<br />&nbsp;<br />EY complies with all local laws and regulations. Applicants for jobs in our offices in Colorado, Connecticut and Nevada can find more information here.&nbsp;<br />&nbsp;<br />What we offer&nbsp;<br />If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;<br />&nbsp;<br />Continuous learning: You&rsquo;ll develop the mindset and skills to navigate whatever comes next.&nbsp;<br />Success as defined by you: We&rsquo;ll provide the tools and flexibility, so you can make a meaningful impact, your way.&nbsp;<br />Transformative leadership: We&rsquo;ll give you the insights, coaching and confidence to be the leader the world needs.&nbsp;<br />Diverse and inclusive culture: You&rsquo;ll be embraced for who you are and empowered to use your voice to help others find theirs.&nbsp;<br />&nbsp;<br />If you can demonstrate that you meet the criteria above, please apply here:&nbsp;https://eyglobal.yello.co/jobs/cAdXgrdKP94eIvlpwJtUxw?job_board_id=c1riT--B2O-KySgYWsZO1Q<br />&nbsp;<br />The exceptional EY experience. It&rsquo;s yours to build.&nbsp;<br />&nbsp;<br />EY | Building a better working world&nbsp;<br />EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.&nbsp;<br />&nbsp;<br />EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.&nbsp;<br />&nbsp;<br />EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY&rsquo;s Talent Shared Services Team or email SSC Customer Support at Customer Support</p>",
            "visual_id": "46499",
            "job_title": "EY - Consulting - Technology Risk Intern – Summer 2022",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-01-21T00:00:00-05:00",
                "job_end": "2022-04-27T23:59:59-04:00"
            },
            "postdate": "Jan 21, 2022",
            "deadline": "Apr 27, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/e07/e0757c3eb0ae13adb66e642cc20c57a8.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T054232Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=7fb0e23e415b1a10184a7a97ed4f5a8e12fd01b29fc913361637f365246a8175",
            "favorite": false
        },
        {
            "job_id": "cd386555c42ce85959c3a6f22337b68f",
            "name": "Ernst & Young LLP",
            "blind_flag": 0,
            "job_desc": "<p>Consulting &ndash;&nbsp;Enterprise Risk&nbsp;Intern&nbsp;&ndash; Summer 2022</p>\r\n<p><br />At EY, you&rsquo;ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we&rsquo;re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.</p>\r\n<p><br />EY offers a variety of career paths and opportunities, and with so many options, we understand it can be hard to choose. To have the best candidate experience, we encourage you to apply to&nbsp;no more than 2 positions within a 6-month period.</p>\r\n<p><br />To learn more about career opportunities, visit Careers at EY (https://www.ey.com/en_us/careers). Prior to completing your application, please be diligent in reviewing the job description to ensure you meet the qualifications for the position.</p>\r\n<p><br />If we are unable to consider you for this particular position, a recruiter may contact you to gauge your interest in other opportunities at EY.<br />&nbsp;<br />What if your career could have a lasting impact on you, and on the world?&nbsp;<br />Here at EY, you&rsquo;ll have the chance to build a truly exceptional experience. We&rsquo;ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you&rsquo;ll develop the skillsets you need to stay relevant today&nbsp;and in the future&nbsp;&ndash; all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.&nbsp;&nbsp;<br />&nbsp;<br />The opportunity: your next adventure awaits.<br />&nbsp;<br />At EY Consulting, we are building a better working world by transforming businesses through the power of people, technology and innovation.&nbsp;Our clients are at the heart of what we do. We&rsquo;re focused on solving the key issues of our client buyers, building deeper relationships and making a greater impact with long-term value.&nbsp;<br />&nbsp;<br />Enterprise Risk is dedicated to helping our clients identify, assess and manage financial, operational, compliance, IT and strategic risks across their enterprise to provide value to their business. As a part of the Enterprise Risk team, you will work&nbsp;hand-in-hand&nbsp;with senior team members to help clients manage their risks (and improve their organizational processes) through designing, establishing and maintaining an effective process, risk and control environment. As a trusted business advisor, EY assists our clients in assessing and responding to risks in both a consulting and assurance context. This dual perspective provides our consultants with an in-depth understanding of a company&rsquo;s strategic priorities, business strategies, business and IT processes, operations, and corresponding risks and controls.&nbsp;&nbsp;We focus on a variety of industries including but not limited to:&nbsp;&nbsp;Advanced Manufacturing &amp; Mobility, Power &amp; Utilities, Health Sciences &amp; Wellness, Consumer, and Technology, Media &amp; Entertainment, Telecommunications.<br />&nbsp;<br />Candidates can elect to join the Government &amp; Public Sector (GPS) practice and will work exclusively with federal clients, as well as state and local agencies and higher education institutions.&nbsp;&nbsp;<br />&nbsp;<br />Candidates can elect to join the Financial Services Organization (FSO) and will focus exclusively&nbsp;in&nbsp;financial services; they will have opportunities to serve leading investment banks, retail and commercial banks, insurers and investment managers.&nbsp;<br />&nbsp;<br />Whether you choose to join GPS, FSO, or pursue a broader industry focus, you will gain foundational skills for a long career in our Consulting practice.&nbsp;<br />&nbsp;<br />Your key responsibilities&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Understanding and documenting clients&rsquo; business and IT strategies as well as processes, to identify gaps or issues with risk management and control design elements&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Helping our clients&rsquo; design and implement risk management and internal control strategies to mitigate strategic, financial, operational and compliance risks&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Designing and executing tests of controls to support client management&rsquo;s assessment of their internal controls&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Performing internal audits over specified areas (e.g., strategy, operations, finance, IT) of client businesses and drafting observations for inclusion in reports of findings and recommendations on how to improve processes and better mitigate risk&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Evaluating and assessing client operations to identify potential issues, performing root cause analysis and providing recommendations for remediation&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Monitoring and managing project and task status, ensuring key stakeholders are kept informed about progress and expected outcomes &nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Building lasting relationships with our clients and understanding their unique business model, ambitions and problems to allow EY to deliver reliable, tailored support as a trusted business advisor&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Having a strong focus on developing a reputation as a trusted resource in your area by continuously updating your understanding of current business and industry trends through learning and development opportunities&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Communicating professionally and effectively, both verbally and written, with supervisors, team members, and client contacts&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Being accountable for assigned tasks including conducting consistent self-review of work to identify and improve an approach for producing high quality deliverables&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Engaging with your supervisor to understand and address feedback on work products and incorporating guidance into future performance&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Self-managing and reporting time and expenses related to project activities and tasks on&nbsp;daily&nbsp;and weekly basis&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Drafting illustrations of business and IT processes using flow charts, narratives or other technologies&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Developing controls testing strategy and approach&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Testing internal controls by reviewing and documenting relevant evidence to conclude on the design and operational effectiveness of controls and the overall control environment&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assisting with the following activities in support of internal audit projects: risk assessment(s), audit planning and scoping, execution and documentation of business processes and/or IT systems, and audit reporting&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Corresponding with client contacts and supervisors to understand key concepts, support and conclusions&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Drafting components of client deliverables such as audit reports, risks assessments, and quality assessments&nbsp;<br />&nbsp;<br />What we look for&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You have an agile, growth-oriented mindset.&nbsp;What you know matters. But the right mindset is just as important in determining success. We&rsquo;re looking for people who&nbsp;are innovative, can work in an agile way&nbsp;and keep pace with&nbsp;a&nbsp;rapidly changing world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are curious and purpose driven.&nbsp;We&rsquo;re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are inclusive.&nbsp;We&rsquo;re looking for people who seek out and embrace diverse perspectives, who value differences,&nbsp;and team inclusively to build safety and trust.&nbsp;&nbsp;&nbsp;<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;Qualifications<br />o&nbsp;&nbsp;A bachelor&rsquo;s or master&rsquo;s degree in Accounting or Accounting with an emphasis in Information Systems or Computer Science&nbsp;<br />o&nbsp;&nbsp;Desire to work in the areas of risk management, internal controls and/or internal audit as demonstrated by relevant course work, interest or internship experience&nbsp;<br />o&nbsp;&nbsp;The flexibility and willingness to travel as well as work in excess of standard hours when necessary&nbsp;<br />o&nbsp;&nbsp;The understanding that travel is an essential function of the job, and may vary by location and can range between 40-60%&nbsp;<br />o&nbsp;&nbsp;Proficiency with MS Office, including MS Excel, MS Word, MS PowerPoint, MS Teams, MS Outlook and MS Power Bi&nbsp;<br />o&nbsp;&nbsp;Willingness and ability to learn and work both independently with minimal supervision and collaboratively within a team&nbsp;<br />o&nbsp;&nbsp;Demonstrated project management, teaming, organizational, analytical and problem-solving skills&nbsp;<br />o&nbsp;&nbsp;Excellent interpersonal, written and verbal communication skills&nbsp;<br />o&nbsp;&nbsp;Demonstrated ability to develop relationships, both internally and with client stakeholders&nbsp;<br />o&nbsp;&nbsp;Effective organization and time management skills with the ability to work under pressure and adhere to project deadlines&nbsp;<br />o&nbsp;&nbsp;Integrity within a professional environment&nbsp;<br />o&nbsp;&nbsp;A driver&rsquo;s license valid in the U.S.&nbsp;&nbsp;<br />o&nbsp;&nbsp;Candidates interested in the Government &amp; Public Sector focus must have U.S. citizenship and be able to obtain and maintain a secret clearance or higher, within the designated time frame, which will be determined by the engagement requirements for a security clearance.&nbsp;&nbsp;&nbsp;<br />&nbsp;<br />What&rsquo;s in it for you &nbsp;<br />Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.&nbsp;<br />Broaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds &mdash; both professionally and culturally.&nbsp;<br />Bring out the best in yourself with continuous investment in your personal well-being and career development.&nbsp;<br />Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society &ndash; building a better working world, together.&nbsp;<br />If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;</p>\r\n<p><br />What you can expect&nbsp;<br />Our approach to hiring utilizes several different formats throughout the course of the recruiting process.&nbsp;<br />In addition to speaking with our recruiters and client-serving professionals, we also leverage game-based assessments to assess your non-technical skills and attributes in a quick and engaging experience. This includes your collaboration style and your abilities to work with information and the use of pre-recorded video interviews (PRVI). PRVI technology provides a great opportunity for you to share more about your qualifications and interests, as well as to ask more specifics about EY and the role for which you are interviewing. It also provides you with the flexibility and convenience of completing at a time and place that works best for your schedule.&nbsp;<br />Additional interviews may be in the form of a live interview, either via video or in-person.&nbsp;<br />&nbsp;<br />EY complies with all local laws and regulations. Applicants for jobs in our offices in Colorado, Connecticut and Nevada can find more information here.&nbsp;<br />&nbsp;<br />What we offer&nbsp;<br />If you join EY full-time after your internship, we offer a&nbsp;competitive compensation package where you&rsquo;ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you&rsquo;ll decide how much vacation time you need based on your own personal circumstances. You&rsquo;ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.&nbsp;<br />&nbsp;<br />Continuous learning: You&rsquo;ll develop the mindset and skills to navigate whatever comes next.&nbsp;<br />Success as defined by you: We&rsquo;ll provide the tools and flexibility, so you can make a meaningful impact, your way.&nbsp;<br />Transformative leadership: We&rsquo;ll give you the insights, coaching and confidence to be the leader the world needs.&nbsp;<br />Diverse and inclusive culture: You&rsquo;ll be embraced for who you are and empowered to use your voice to help others find theirs.&nbsp;<br />&nbsp;<br />If you can demonstrate that you meet the criteria above, please apply here:&nbsp;https://eyglobal.yello.co/jobs/D3lS14NeXBp2BdrgBhYpnA?job_board_id=c1riT--B2O-KySgYWsZO1Q<br />&nbsp;<br />The exceptional EY experience. It&rsquo;s yours to build.&nbsp;<br />&nbsp;<br />EY | Building a better working world&nbsp;<br />EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.&nbsp;<br />&nbsp;<br />EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.&nbsp;<br />&nbsp;<br />EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY&rsquo;s Talent Shared Services Team or email SSC Customer Support at Customer Support.</p>",
            "visual_id": "46494",
            "job_title": "EY - Consulting – Enterprise Risk Intern – Summer 2022",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-01-21T00:00:00-05:00",
                "job_end": "2022-04-27T23:59:59-04:00"
            },
            "postdate": "Jan 21, 2022",
            "deadline": "Apr 27, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/e07/e0757c3eb0ae13adb66e642cc20c57a8.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T054232Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=7fb0e23e415b1a10184a7a97ed4f5a8e12fd01b29fc913361637f365246a8175",
            "favorite": false
        }
    ],
    "metadata": {
        "defaultFilters": {
            "ocr_status": "a"
        },
        "currentSort": {
            "postdate": "desc"
        }
    },
    "columns": [
        {
            "field": "name",
            "display": null
        },
        {
            "field": "blind_flag",
            "display": null
        },
        {
            "field": "job_desc",
            "display": "Job Description"
        },
        {
            "field": "pickVal",
            "display": null
        },
        {
            "field": "visual_id",
            "display": null
        },
        {
            "field": "job_title",
            "display": null
        },
        {
            "field": "job_start",
            "display": null
        },
        {
            "field": "job_end",
            "display": null
        },
        {
            "field": "application_deadline",
            "display": null
        },
        {
            "field": "ocr_flag",
            "display": null
        },
        {
            "field": "job_type",
            "display": null
        },
        {
            "field": "symp_remote_job",
            "display": null
        },
        {
            "field": "resume_mode",
            "display": null
        },
        {
            "field": "in_app_application",
            "display": "Can apply on App"
        },
        {
            "field": "qualified",
            "display": "Qualified"
        },
        {
            "field": "source",
            "display": null
        },
        {
            "field": "imported_id",
            "display": null
        },
        {
            "field": "contact_info",
            "display": null
        }
    ]
}