{
    "perPage": 20,
    "page": 1,
    "total": 10,
    "className": "job",
    "models": [
        {
            "job_id": "7a481e252cc933e57134ca789b1ddc7d",
            "name": "Earnix",
            "blind_flag": 0,
            "job_desc": "<p><strong>PLEASE NOTE: This is not an entry-level role and requires at least 4 solid years of software product support, 2 of which must be at Level II, to be considered.</strong></p>\r\n<p>We are looking for an L2 Support Engineer to join our Customer Support team. The position requires acting as the technical focal point for customers, investigating and analyzing complex customer scenarios and providing innovative solutions for their needs. The role may include other responsibilities such as team&rsquo;s knowledge management, KPI analysis, amongst others.</p>\r\n<p><strong>What you&rsquo;ll do:</strong></p>\r\n<ul>\r\n<li>Have end-to-end responsibility for solving L2 cases under defined SLAs</li>\r\n<li>In-depth analysis of field raised issues, providing temporary workarounds while working with L3, DevOps, R&amp;D and Product on permanent solutions and fixes</li>\r\n<li>Proactively identify critical points of failure, raise flags &amp; escalate issues that are of urgent nature</li>\r\n<li>Responsible for knowledge management, training content and playbooks for all Support Tiers</li>\r\n<li>Work closely with Professional Services experts and Customer Success Managers to prioritize issues, communicate status, and oversee end-to-end resolution</li>\r\n<li>Participate in the team&rsquo;s on-call rotation&nbsp;</li>\r\n</ul>\r\n<p><strong>Requirements:</strong></p>\r\n<ul>\r\n<li><em><strong>2-3 years of experience as an L2 engineer in SaaS organizations in a B2B customer service/support setting &ndash; A must</strong></em></li>\r\n<li>Great interpersonal skills with a service-oriented approach</li>\r\n<li>Excellent problem-solving skills with a desire to learn and to take on responsibility</li>\r\n<li>Detailed oriented, motivated self-learner and excellent team player</li>\r\n<li>Proficiency in communication and presentation skills, both written and verbal (English - Spanish a plus)</li>\r\n<li>Experience with Linux, Container engines, Windows, Bash and Python</li>\r\n<li>Experience with AWS &ndash; a strong advantage</li>\r\n<li>Experience with JBoss, PostgreSQL, Containers and Java - an advantage</li>\r\n<li>Advanced understanding of networking &ndash; an advantage</li>\r\n<li>Ability to work in a fast-paced and dynamic environment</li>\r\n</ul>",
            "visual_id": "55976",
            "job_title": "Level 2 Customer Support Engineer",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-04-12T00:00:00-04:00",
                "job_end": "2022-05-12T23:59:59-04:00"
            },
            "postdate": "Apr 12, 2022",
            "deadline": "May 12, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Waltham, Massachusetts, United States",
            "employer_logo": "",
            "favorite": false
        },
        {
            "job_id": "a54a56854c2e95aa671d46efe3b4ddcc",
            "name": "QSimulate",
            "blind_flag": 0,
            "job_desc": "<p>Do you want to be part of a cutting-edge effort to use quantum mechanics to change the world?</p>\r\n<p><br />QSimulate is building a world-class team to accelerate scientific discovery. Our platform provides paradigm-shifting quantum-mechanics-based tools for scientists worldwide. These tools are being used in such areas as Drug Discovery, Materials Design, and AI.</p>\r\n<p><br />We are looking for an operations co-op to support our company's internal operations. This person will work with our operations manager to streamline internal operations, including administrative, HR, marketing, and finance duties.&nbsp;</p>\r\n<p><br />Role</p>\r\n<ul>\r\n<li>Assist with HR duties including, recruiting, onboarding, and team and culture initiatives.</li>\r\n<li>Streamline business operations including administrative, legal, and financial processes.</li>\r\n<li>Document internal operations processes as well as identify areas for improvement.</li>\r\n<li>Assist on special projects as required.&nbsp;</li>\r\n</ul>\r\n<p>Qualifications</p>\r\n<ul>\r\n<li>0-2 years experience in business operations.</li>\r\n<li>Excellent verbal and written communication skills.</li>\r\n<li>High attention to detail.</li>\r\n<li>Team player and can-do attitude.</li>\r\n<li>A highly adaptable team player who can juggle multiple priorities and thrive in a rapidly changing startup environment.&nbsp;</li>\r\n</ul>\r\n<p>We offer&nbsp;</p>\r\n<ul>\r\n<li>The opportunity to make an immediate and visible impact within a fast growing company with lots of potential.</li>\r\n<li>Passionate and fun teammates.</li>\r\n<li>Competitive compensation.</li>\r\n</ul>\r\n<p>QSimulate is dedicated to building a diverse team of individuals who are committed to contributing to an inclusive environment. Our core values include respect for all, serving the greater good, and welcoming individuals from diverse backgrounds, experiences, and perspectives.</p>\r\n<p><br />We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.&nbsp;</p>\r\n<p><br />We consider exceptional candidates with strong backgrounds even if you don't check every box.</p>",
            "visual_id": "55766",
            "job_title": "Operations Intern",
            "ocr_flag": 0,
            "job_type": [
                "Internship"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-04-11T00:00:00-04:00",
                "job_end": "2022-05-31T23:59:59-04:00"
            },
            "postdate": "Apr 11, 2022",
            "deadline": "May 31, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/c90/c900677d1ce1cc515861c0b87a72b005.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T090645Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=bbe2072bbd87f5bbd0c0356d3098fcbb3f663518a69515e4106df3b46c5ae16a",
            "favorite": false
        },
        {
            "job_id": "e1eefd219a7d3bb3e76d49e097fb26f1",
            "name": " Powerhouse Dynamics (PhD)",
            "blind_flag": 0,
            "job_desc": "<p><strong>Staff Accountant &ndash; New Position! Open due to growth! Hybrid</strong><br />&nbsp;</p>\r\n<p><strong>Do you want to be part of a dynamic, growing organization? &nbsp;Are you looking for a work/life balance?&nbsp; Come work with us to help our customers achieve higher profitability, lower&nbsp;energy costs, and more sustainable operations!</strong></p>\r\n<p>&nbsp;</p>\r\n<p><strong>Powerhouse Dynamics (PhD)</strong>, a <strong>Middleby</strong> company, is a growing and innovative firm operating at the intersection between food-tech and clean-tech and that growth has resulted in the need to expand our accounting department and bring on board a high energy</p>\r\n<p>This position is for an on-site employee, when it&rsquo;s safe, who is authorized to work for any employer in the US without visa sponsorship now or in the future.&nbsp;&nbsp; We are not looking for a consultant, freelancer or an accounting consulting firm on or off-shore. No relocation available.</p>\r\n<p>PhD delivers customer-proven, IoT-based solutions that help restaurants, retailers, and other multi-site organizations better manage their equipment, lower costs, reduce energy consumption, enhance food safety and quality, and achieve their sustainability goals. SiteSage&reg; and Open Kitchen&reg; have been adopted by numerous major brands at thousands of their locations, including Arby's, Dunkin&rsquo; Donuts, Buffalo Wild Wings, Texas Roadhouse, Pizza Hut, Ann Taylor, Five Below, Lush Cosmetics, and many more.</p>\r\n<p>We are looking for a hands-on accounting professional to manage and perform the following accounting and financial reporting functions.&nbsp;</p>\r\n<p><strong>Responsibilities include:</strong></p>\r\n<p><strong>Manage all accounting operations for A/R</strong></p>\r\n<ul>\r\n<li>Manual Invoicing</li>\r\n<li>Making deposits</li>\r\n<li>Applying Credit Memo&rsquo;s</li>\r\n<li>Applying payments &ndash; Credit Card, ETF and Checks</li>\r\n<li>Issuing monthly statements and following up with customers regarding collection issue.<br /><strong></strong></li>\r\n</ul>\r\n<p><strong>Manage all accounting operations for A/P</strong></p>\r\n<ul>\r\n<li>Entering Bills in QuickBooks and Bill.com</li>\r\n<li>Check run process of printing and mailing checks</li>\r\n<li>ETF payments (Bank of America CashPro)</li>\r\n<li>Issuing PO</li>\r\n<li>BOA - Positive Pay</li>\r\n<li>Manage Vendor relationship to follow up and communications regarding AP invoices</li>\r\n<li>Manage some aspects of G/L</li>\r\n<li>Entering Journal Entries</li>\r\n<li>Account Reconciliations</li>\r\n<li>Ad-hoc G/L projects and reporting</li>\r\n</ul>\r\n<p><strong>Qualifications, Experience, and Education:</strong></p>\r\n<ul>\r\n<li>Bachelor&rsquo;s degree in accounting preferred or a Bachelor&rsquo;s in business with an accounting major</li>\r\n<li>Minimum 1-2 years of accounting experience demonstrating the ability to assume more as needed</li>\r\n<li>Small company experience strongly preferred</li>\r\n<li>Self-starter comfortable working within an entrepreneurial environment and assuming a strong sense of ownership over all accounting-related matters</li>\r\n<li>Proficient with Excel and accounting software (Quick Books Desktop Premier</li>\r\n<li>Manufacturing and Wholesale Edition 2020 preferred)</li>\r\n<li>Excellent communication skills and responsiveness</li>\r\n<li>Willingness to learn, grow and be challenged<br /><strong></strong></li>\r\n</ul>\r\n<p><strong>We offer an excellent compensation and benefits package including medical, dental, vision, PTO, a 401K and more!&nbsp; Benefits start on your first day of employment.&nbsp; We believe in a work/life balance!</strong>&nbsp;</p>\r\n<p>To apply, please email your resume and salary requirements with the subject &ldquo;Staff Accountant&rdquo; to:Laurie@powerhousedynamics.com</p>\r\n<p>No phone calls or third parties please. Powerhouse Dynamics is an equal opportunity employer.</p>",
            "visual_id": "55679",
            "job_title": "Staff Accountant",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-04-08T00:00:00-04:00",
                "job_end": "2022-06-08T23:59:59-04:00"
            },
            "postdate": "Apr 08, 2022",
            "deadline": "Jun 08, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Newton, Massachusetts, United States",
            "employer_logo": "",
            "favorite": false
        },
        {
            "job_id": "b70415af4a2d1e2902b9ce7f48a4a02b",
            "name": "Zilla Security",
            "blind_flag": 0,
            "job_desc": "<p>Zilla Security is seeking a Sales Development Representative (SDR) to help in identifying new sales opportunities for account executives to close.</p>\r\n<p>Zilla Security is looking for junior sales talent that wants to build a career. Our Sales Development Representatives are driven, have a &ldquo;we&rdquo; mentality, strive to continuously improve and want to be winners. You will work cooperatively with the sales team to penetrate new business opportunities and meet/exceed monthly sales targets. You'll utilize new and existing sources of leads to contact prospects, uncover, and develop qualified sales opportunities that convert to pipeline for our Account Executives.</p>\r\n<p>This position requires aggressive identification and qualification of new business opportunities through cold calling, email, web and offline based initiatives. Prior lead generation or sales prospecting experience and a college degree will enhance your candidacy for this role.</p>\r\n<p>What you'll do</p>\r\n<p>- Drive top-of-the-funnel lead generation for account executives and sales&nbsp; managers<br />- Update and manage all sales activities, opportunities, and account information in CRM<br />- Consistently achieve a monthly quota of qualified opportunities<br />- Research and identify new business opportunities<br />- Call prospective clients in order to identify qualified decision-makers &amp; generate awareness<br />- Build an effective pipeline, and schedule meetings for Account Executives<br />- Navigate company structures to get past gatekeepers and influence decision-makers<br />- Maintain detailed records in Salesforce<br />- Assume other duties and responsibilities as needed<br />- Find creative avenues to connect with a new generation of buyers</p>\r\n<p>What you have:</p>\r\n<p>- Prior sales and marketing internship or work experience is preferred<br />- Possesses a track record of being a self-starter and a &lsquo;go getter&rsquo;<br />- A desire to build their career in sales and learn sales<br />- Growth mindset<br />- Must be coachable, driven, and hard-working<br />- Excellent written and verbal communication skills<br />- Ability to multitask, organize, and prioritize<br />- Working knowledge of Salesforce, Hubspot, or similar tools<br /><br /></p>",
            "visual_id": "54823",
            "job_title": "Sales Development Representative",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-30T00:00:00-04:00",
                "job_end": "2022-05-30T23:59:59-04:00"
            },
            "postdate": "Mar 30, 2022",
            "deadline": "May 30, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/4df/4dfcf0f0b6d2365b9fd633deed5cab8e.jpg?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T131102Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=508d4586778a989d08554b359f83d2bc931e808700ae1d2a043f6b3c8e4891a8",
            "favorite": false
        },
        {
            "job_id": "5fbac75af0954594cea0262878d2d87f",
            "name": "Jobble",
            "blind_flag": 0,
            "job_desc": "<p>Jobble is the epicenter of the gig economy that connects the 70 million essential workers seeking jobs with companies offering flexible work opportunities. Since 2016, Jobble has partnered with over 14,000 gig economy business partners and has over 4,000,000 jobs in over 1,600 cities in all 50 states. We&rsquo;re on a mission to empower the independent worker by providing access to opportunities that maximize daily income potential and providing comprehensive benefits and financial solutions that support them now and in the future.</p>\r\n<p>Jobble is experiencing tremendous growth despite the global pandemic. The marketplace has quickly become a vital component for businesses in need of rapidly adopting a flexible workforce and has cemented itself as the go-to-resource for the now appropriately recognized &ldquo;essential workers&rdquo;.</p>\r\n<p>Jobble&rsquo;s Product Manager will be responsible for working with stakeholders in order to define requirements and criteria for product features and functions. The successful candidate will possess exceptional communication skills and will be able to liaison between the business and technical side of Jobble&rsquo;s business. Their responsibilities will include duties such as building a product that&rsquo;s easy to learn, simple to use, and grows to meet our Jobblers&rsquo; complex needs.</p>\r\n<p>Responsibilities:</p>\r\n<p>Gather feedback from stakeholders to define requirements, user stories, and acceptance criteria for product functions and features<br />Build a product that&rsquo;s easy to learn, simple to use, and grows to meet our Jobblers&rsquo; needs<br />Identify the key points of value creation for both sides of the business and align product and UX to maximize potential impact<br />Communicate the status of projects on the product roadmap and in development to the organization - both the business and technical side<br />Oversee implementation and release workflow and deadlines</p>",
            "visual_id": "54803",
            "job_title": "Product Manager",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-29T00:00:00-04:00",
                "job_end": "2022-10-31T23:59:59-04:00"
            },
            "postdate": "Mar 29, 2022",
            "deadline": "Oct 31, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/f19/f1908e4fb36533aacf61a88ce4e0cd66.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T100326Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=51c821969e12551fbc89f7f6f4077aafe1d709f48d74836427020c2dda206565",
            "favorite": false
        },
        {
            "job_id": "17f940cf5d13c0358aee8187b5ab59a4",
            "name": "Zeta Surgical",
            "blind_flag": 0,
            "job_desc": "<p><strong>About</strong></p>\r\n<p>Zeta Surgical is a digital surgery company focused on improving the accuracy, safety and accessibility of image guided surgery. Its navigation and robotics platform Zeta&nbsp;leverages cutting-edge computer vision and artificial intelligence to unlock the use of image guidance directly at the point-of-care, enabling new possibilities in fields such as emergency care and interventional medicine. Zeta Surgical was founded by Harvard graduates and faculty, is partnered with leading universities, and is backed by top investors.</p>\r\n<p><strong>Position</strong></p>\r\n<p>As Principal Product Engineer, you will be responsible for applying existing design language to current system product development work, defining, and refining new part designs, and collaborating with internal and external resources and clinicians. You will also work closely on new product initiatives with various stakeholders such as research partners, engineers, and our business and regulatory teams.</p>\r\n<p><strong>Responsibilities</strong></p>\r\n<p>Participate in all phases of product development, including user need and requirements definition, concept generation, detailed design, clinical simulation, manufacturing process development, assembly, integration, verification, and validation testing.</p>\r\n<p><strong>Skills</strong></p>\r\n<ul>\r\n<li>Self-motivated with strong problem solving and analytical skills.</li>\r\n<li>Ability to communicate across technical and non-technical teams.</li>\r\n<li>Experience with rapid prototyping and 3D modeling.</li>\r\n<li>Experience interviewing users and performing usability testing is a plus.</li>\r\n<li>Experience developing medical products is a plus.</li>\r\n</ul>",
            "visual_id": "54492",
            "job_title": "Principal Product Engineer",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-28T00:00:00-04:00",
                "job_end": "2022-04-29T23:59:59-04:00"
            },
            "postdate": "Mar 28, 2022",
            "deadline": "Apr 29, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/8e8/8e884a8289437ee377d16fcab46df629.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T055401Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=d645a8e350ad41c8acf1678b67523cae366c7550a0a640746718209bd2489b4e",
            "favorite": false
        },
        {
            "job_id": "10eddcb6c854b55364bcf6a4f1a0a9b5",
            "name": "Zeta Surgical",
            "blind_flag": 0,
            "job_desc": "<p><strong>About</strong></p>\r\n<p>Zeta Surgical is a digital surgery company focused on improving the accuracy, safety and accessibility of image guided surgery. Its navigation and robotics platform Zeta leverages cutting-edge computer vision and artificial intelligence to unlock the use of image guidance directly at the point-of-care, enabling new possibilities in fields such as emergency care and interventional medicine. Zeta Surgical was founded by Harvard graduates and faculty, is partnered with leading universities, and is backed by top investors.</p>\r\n<p><strong>Position</strong></p>\r\n<p>As a Software Engineer, you will be responsible for designing, developing, and integrating software that enable our surgical robotic and navigation platforms. As a member of the engineering team, you will work closely with other engineers to design and develop software from the research phase to manufacturing.</p>\r\n<p><strong>Responsibilities</strong></p>\r\n<p>Work on a cross-functional team to design, implement, document and qualify software to be used in medical robots. Collaborate with the product team, hardware/software developers, and manufacturing engineers to drive new software features and develop comprehensive software solutions to meet specific requirements. Ensure FDA compliance through documentation, unit testing, peer reviews, and validation of software output. Support the manufacturing team in verification and validation activities.</p>\r\n<p><strong>Skills</strong></p>\r\n<ul>\r\n<li>Self-motivated with strong problem solving and analytical skills. Ability to communicate across technical and non-technical teams.</li>\r\n<li>Proficiency with C/C++.</li>\r\n<li>Experience with Nvidia CUDA, Python is a plus.</li>\r\n<li>Experience in computer vision or GPU computing is a plus.</li>\r\n</ul>",
            "visual_id": "54493",
            "job_title": "Software Engineer",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-28T00:00:00-04:00",
                "job_end": "2022-04-29T23:59:59-04:00"
            },
            "postdate": "Mar 28, 2022",
            "deadline": "Apr 29, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/8e8/8e884a8289437ee377d16fcab46df629.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T055401Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=d645a8e350ad41c8acf1678b67523cae366c7550a0a640746718209bd2489b4e",
            "favorite": false
        },
        {
            "job_id": "8d1addf6b17026d2b6285870bd125c7b",
            "name": "Zeta Surgical",
            "blind_flag": 0,
            "job_desc": "<p><strong>About</strong></p>\r\n<p>Zeta Surgical is a digital surgery company focused on improving the accuracy, safety and accessibility of image guided surgery. Its navigation and robotics platform Zeta&nbsp;leverages cutting-edge computer vision and artificial intelligence to unlock the use of image guidance directly at the point-of-care, enabling new possibilities in fields such as emergency care and interventional medicine. Zeta Surgical was founded by Harvard graduates and faculty, is partnered with leading universities, and is backed by top investors.</p>\r\n<p><strong>Position</strong></p>\r\n<p>As a Systems Engineer, you will contribute to all aspects of system-level design, integration, testing, and medical device design controls. In this role, you will be asked to lean on your experience of regulatory standards to ensure our system requirements are complete and robust and meet all relevant standards.&nbsp;</p>\r\n<p><strong>Responsibilities</strong></p>\r\n<ul>\r\n<li>Lead projects and initiatives to test concepts, develop prototypes, and answer key questions.</li>\r\n<li>Interface with key stakeholders to translate market needs to system requirements.</li>\r\n<li>Collaborate with Quality, Regulatory, and Clinical representatives to satisfy each department&rsquo;s needs from Engineering and to achieve common goals.</li>\r\n<li>Develop formal requirements, contribute to risk-management activities, and develop other design controls including architectures and detailed design documents.</li>\r\n<li>Lead compliance efforts for mechanical and electrical systems and perform design reviews with design leads.</li>\r\n</ul>\r\n<p><strong>Skills</strong></p>\r\n<ul>\r\n<li>Self-motivated with strong problem solving and analytical skills.</li>\r\n<li>Ability to communicate across technical and non-technical teams.</li>\r\n<li>Experience in C/C++ and Python.</li>\r\n<li>Experience working under compliance conformity frameworks.</li>\r\n<li>Experience in verification and validation testing is a plus.</li>\r\n<li>Experience in computer vision or robotics is a plus.</li>\r\n</ul>",
            "visual_id": "54494",
            "job_title": "Systems Engineer",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-28T00:00:00-04:00",
                "job_end": "2022-04-29T23:59:59-04:00"
            },
            "postdate": "Mar 28, 2022",
            "deadline": "Apr 29, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/8e8/8e884a8289437ee377d16fcab46df629.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T055401Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=d645a8e350ad41c8acf1678b67523cae366c7550a0a640746718209bd2489b4e",
            "favorite": false
        },
        {
            "job_id": "624ca77cf6cc7bdb2f82e4973cdd8613",
            "name": "Jobble",
            "blind_flag": 0,
            "job_desc": "<p>Digital Marketing Strategist</p>\r\n<p>Jobble is the epicenter of the gig economy that connects the 70 million essential workers seeking jobs with companies offering flexible work opportunities. Since 2016, Jobble has partnered with over 14,000 gig economy business partners and has over 4,000,000 jobs in over 1,600 cities in all 50 states. We&rsquo;re on a mission to empower the independent worker by providing access to opportunities that maximize daily income potential and providing comprehensive benefits and financial solutions that support them now and in the future.</p>\r\n<p>Jobble is experiencing tremendous growth despite the global pandemic. The marketplace has quickly become a vital component for businesses in need of rapidly adopting a flexible workforce and has cemented itself as the go-to-resource for the now appropriately recognized &ldquo;essential workers&rdquo;.</p>\r\n<p>Qualifications</p>\r\n<p>2-5 years of experience running a cross-platform social strategy for a major brand<br />Comprehensive understanding across all social platforms, including video-based social media platforms, features, and formats, specifically Instagram, Twitter, Facebook, Instagram Reels and TikTok.<br />Experience with HootSuite or another platform to schedule content and report on metrics<br />Expert-level knowledge of programmatic media, paid social, budget management and other paid channels<br />Substantial experience working with performance marketing metrics (CPI, CAC, LTV, etc.)<br />Proven ability to build collaborative relationships with influencers and digital bloggers<br />Proven track record of building an engaged audience (100k+ users)<br />Experience handling mobile app user growth, with a focus on sustainable revenue growth<br />Experience in app-centric tools, deep-linking, push notifications, and digital media optimization<br />Ability to manage and juggle multiple requests in a fast-moving environment<br />Bachelor's Degree or equivalent<br />Responsibilities:</p>\r\n<p>Create Content &amp; Campaigns</p>\r\n<p>Maintain social media content calendars and execute day-to-day scheduling and publishing across all platforms<br />Design and develop engaging creatives (including images, GIFs, post captions, content polls, contests, surveys, and video)<br />Build and nurture relationships with outside content creators (like social media influencers)<br />Strategize growth campaigns through partnering social media with other communication mediums (like email)<br />Proactively integrate social media or industry trends into content calendar<br />Monitor Performance &amp; Metrics</p>\r\n<p>Report on KPIs to: show the success of each campaign; track conversions; increase growth and engagement<br />Oversee and continue to improve tracking, attribution, and overall data access to analyze key metrics, including downloads, active users, CAC, CPI, LTV and return on ad spend<br />Analyze current marketing initiatives and make recommendations for improvement and content optimization<br />Balance and maintain budgets for various campaigns<br />Encourage Engagement &amp; Growth</p>\r\n<p>Oversee brand awareness and reputation management in public online areas (e.g., Facebook, Instagram, Linkedin, Twitter, Apple app store, Google Playstore, etc)<br />Create campaigns for user-generated content that can be used on social media as well as other marketing channels<br />Support the growth of other departments in Jobble when possible (ex: acquisition campaigns, job or company spotlights, promoting the referral program)<br />Additional Requirements and Skills:</p>\r\n<p>Creative</p>\r\n<p>Attention to Detail - Consider every aesthetic detail of social posts, from images to links to formatting of copy and captions<br />Have an excellent eye for quality photography and video content<br />Ability to develop innovative, risk-taking social campaigns<br />Have some experience with graphic design or photo/video editing (such as experience working with Adobe Creative Suite or Canva)<br />Analytical</p>\r\n<p>Understanding of SEO and web traffic metrics<br />Experience with audience and buyer persona research<br />Strong analytical skills and ability to quickly pivot and react to a new trend, opportunity or crisis<br />Firm understanding of both quantitative and qualitative data<br />Experience developing, analyzing and maintaining detailed parameter tracking to measure engagement and success<br />Ability to conceptualize campaigns and distribution rhythms<br />Communication</p>\r\n<p>Experience with customer service, encouraging community engagement, and de-escalating situations in a public manner<br />Be a digital conversationalist with strong instincts for successful storytelling and marketing<br />Have a clear understanding of other traditional and digital marketing approaches: email, events, lead generation, PR, etc<br />Practice strong communications skills that can flex to fit any platform, media, character count, or audience</p>\r\n<p><br />What working at Jobble looks like:</p>\r\n<p>The ability to work from anywhere - we have a fully remote team across the globe<br />Competitive compensation packages<br />Equity - we all own a part of the business<br />A generous PTO plan with 31 days off a year<br />Parental Leave programs<br />Health and wellness plans to meet the needs of you and your family including medical, dental, and vision<br />Smart, supportive colleagues with diverse backgrounds and experiences<br />Jobble is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</p>\r\n<p></p>\r\n<p><br />Jobble, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.</p>",
            "visual_id": "54451",
            "job_title": "Marketing Strategist",
            "ocr_flag": 0,
            "job_type": [
                "Full Time / Part Time"
            ],
            "symp_remote_job": 0,
            "qualified": "",
            "jobs_iso_times": {
                "job_start": "2022-03-25T00:00:00-04:00",
                "job_end": "2022-06-30T23:59:59-04:00"
            },
            "postdate": "Mar 25, 2022",
            "deadline": "Jun 30, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Nationwide, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/f19/f1908e4fb36533aacf61a88ce4e0cd66.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T100326Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=51c821969e12551fbc89f7f6f4077aafe1d709f48d74836427020c2dda206565",
            "favorite": false
        },
        {
            "job_id": "2afabf2350a6ca63a28a4559a734585a",
            "name": "Funnel.io",
            "blind_flag": 0,
            "job_desc": "<p>Funnel, a well-funded startup in marketing tech, is searching for their next colleagues to join the Data Operations team and help customers solve their newest and often most complex data problems. If you're intrigued by the prospect of joining a rapidly growing company with a very strong emphasis on agile teamwork and promoting skill building, then this could be an awesome position for you.</p>\r\n<p><strong>Who We Are</strong><br />Funnel is a fast growing and well-funded startup, working to help marketers understand how their marketing initiatives relate to their business results. Our customers range from huge e-commerce companies to advertising agencies and consumer brands. We&rsquo;re attacking a $4 billion market head on.</p>\r\n<p>Funnel&rsquo;s platform enables marketers to import and consolidate data from all of their marketing tools and channels, and lets them easily export their data to data warehouses (e.g. Amazon Web Services / Redshift) and analysis tools like Google Sheets, Google Data Studio and Tableau. Since the product launch in 2015, we have set up offices in Stockholm and Boston, and grown to service thousands of marketers all over the world, with the US as the largest market. We currently employ over 200 people, and are still growing.</p>\r\n<p>We uphold and promote a &ldquo;people first&rdquo; culture where we consider team achievements and mental well-being key measures of success. We strive for the work environment to be fun, friendly and fulfilling. We believe that psychological safety and individual development are core components that are needed for building successful organizations.</p>\r\n<p><strong>Role Overview</strong></p>\r\n<p>The Data Operations team is responsible for data integration engineering to support Funnel&rsquo;s customers with their data use cases. When a customer needs data imported to Funnel from a source that is not supported by Funnel&rsquo;s &ldquo;out-of-the-box&rdquo; integrations, they come to Data Operations. In other words, the team helps customers set up custom data extraction, configures the import of data in the Funnel platform, and troubleshoots customer problems with the integrations that we&rsquo;ve built for them - in other words, we spend a lot of time working with APIs.</p>\r\n<p>As a Data Integration Co-op, you are a key contributor to ensuring that our customers get maximum value out of Funnel. The job will require creativity, problem-solving as well as an analytical mindset. It&rsquo;s a unique type of role in a team that frequently interacts with various teams in both the Software Development and Commercial departments.</p>\r\n<p>Here's what Data Operations team members are like today:</p>\r\n<ul>\r\n<li><em>Supportive</em> - especially when teammates are faced with new challenges</li>\r\n<li><em>Autonomous</em>, self-directed - often figure out solutions to their own challenges</li>\r\n<li>Value polite, clear, frequent communication (we read and write to each other and our users often)</li>\r\n<li>Are naturally curious and take proactive steps to learn new things</li>\r\n<li>Have a bias to action: problems are solved and there is a clear path forward</li>\r\n<li>Uphold best practices when communicating with Funnel&rsquo;s clients<br /><br /></li>\r\n</ul>\r\n<p><strong>Things We Are Looking For in You</strong></p>\r\n<p><em>Traits</em></p>\r\n<p>These traits and skills are not required, but we think they&rsquo;ll help you work with us better:</p>\r\n<ul>\r\n<li>Customer-centric - the reason we&rsquo;re all here is to bring Funnel&rsquo;s customers joy!</li>\r\n<li>Worked across time zones e.g. with folks in Europe;</li>\r\n<li>Is comfortable working in customer facing roles</li>\r\n<li>Data intuition - you think deeply about data: its shape, how it could be wrong, its formats, where it&rsquo;s going, where it came from, how to transform it</li>\r\n<li>A drive for self-education / self-teaching - our team is evolving to be more technical</li>\r\n<li>Can think through trade-offs, balancing customer happiness, technical solutions and feasibility, and ability to deliver</li>\r\n<li>Enjoy writing documentation, and documenting how you solved / thought through problems</li>\r\n<li>Thinking about scalability, from business processes to code</li>\r\n</ul>\r\n<p><br /><em>Technical Skills</em></p>\r\n<p><br />If you have <em><strong>any</strong></em> experience with the following, that&rsquo;s great! That said, <strong><em>specific keywords or technologies aren&rsquo;t that important to us</em></strong>. Our focus is on whether you can think about data and think about solving business problems with software. <em>Seriously: don't get hung up on these keywords if you are thinking of applying</em>.</p>\r\n<ul>\r\n<li>Python (our team works in this), Java, R</li>\r\n<li>Matlab, VBScript, STATA, SAS, SPSS, Excel macros, Google Scripts</li>\r\n<li>APIs: REST, SOAP</li>\r\n<li>Cloud services (Azure, Amazon Web Services (AWS), Google Cloud Platform (GCP); serverless computing (AWS Lambda)</li>\r\n<li>Databases and SQL: Postgres, Redshift, Snowflake, Vertica, MySQL, MongoDB<br />Git / Github / version control systems</li>\r\n<li>If you speak Mandarin - that is a huge plus!</li>\r\n</ul>\r\n<p><br /><strong>Why You Might Be Excited About Us</strong></p>\r\n<ul>\r\n<li>We&rsquo;re at the forefront of data-engineering-as-a-service and no-code data tools for marketers, and people working with business data. We&rsquo;re pushing the envelope.&nbsp;</li>\r\n<li>We focus intensely on culture and work-life balance. We care about family and personal development, and don&rsquo;t expect for you to always be 100% engaged with work.&nbsp;</li>\r\n<li>Our team has a diverse background of experiences - we come from finance, startups, straight from college, and engineering - and across two continents.&nbsp;</li>\r\n<li>We focus our hiring on traits, believing that they&rsquo;re better to target than technical skills, which you can learn with us.&nbsp;</li>\r\n<li>We care about your happiness at work, and want to help prepare you for whatever you want in your career future.&nbsp;</li>\r\n</ul>\r\n<p><br /><strong>Why You Might Not Be Excited About Us</strong></p>\r\n<ul>\r\n<li>Because we&rsquo;re a startup and this team is evolving towards more technical depth, priorities and our trajectory may shift.&nbsp;</li>\r\n<li>Not all of our processes and procedures are perfect - we firmly believe that almost anything can be done in a better way. If you don&rsquo;t want to contribute to improvements for the team, you may find that frustrating.&nbsp;</li>\r\n<li>Because our team is often autonomous, your responsibility and accountability may not be well defined. We expect you to independently identify where the team needs you to focus your efforts and in what ways you are best equipped to contribute.</li>\r\n<li>We value excellent communication skills - you will interact directly with Funnel&rsquo;s customers.</li>\r\n</ul>\r\n<p><strong>Frequently Asked Questions</strong></p>\r\n<p><em>Where is Funnel located?&nbsp;</em></p>\r\n<p>Funnel&rsquo;s US office is at 175 Federal Street, Boston, Massachusetts, and the corporate headquarters are in Stockholm, Sweden.&nbsp;</p>\r\n<p><em>Are you okay with remote work?</em></p>\r\n<p>Mostly: during COVID, our main concern is to keep staff safe - we have \"hybrid\" schedules that minimize close contact via socially distanced &ldquo;pods&rdquo; and scheduling who is in (and not in) the office day by day. Most people come in to the office 3 days a week. In the future, we plan to continue this hybrid policy - at this time, we do not see 100% remote work as a good fit for us.</p>\r\n<p><em>Can I co-op in Sweden?</em></p>\r\n<p>Probably not due to COVID and travel restrictions, but you can always reach out to us and see how things are going.&nbsp;</p>",
            "visual_id": "49952",
            "job_title": "Data Integration Co-op - Mandarin speaking a PLUS!",
            "ocr_flag": 0,
            "job_type": [
                "Co-op"
            ],
            "symp_remote_job": 0,
            "qualified": "Not Qualified",
            "jobs_iso_times": {
                "job_start": "2022-02-11T00:00:00-05:00",
                "job_end": "2022-06-30T23:59:59-04:00"
            },
            "postdate": "Feb 11, 2022",
            "deadline": "Jun 30, 2022",
            "test2": "<font color=\"#555555\"><b>J</b></font>",
            "not_interested": false,
            "job_location": "Boston, Massachusetts, United States",
            "employer_logo": "https://s3.amazonaws.com/symp.csm.usprod/northeastern/files/aa6/aa6cc3782d9a445f2fe5685b7eef4267.png?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAID3RBESXBCESHUGA%2F20220427%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220427T121912Z&X-Amz-SignedHeaders=host&X-Amz-Expires=86400&X-Amz-Signature=f3884e6f14934d6ba1daff9d7e354faa700de658c2ed8b123a7a028affe2a1d4",
            "favorite": false
        }
    ],
    "metadata": {
        "defaultFilters": {
            "ocr_status": "a"
        },
        "currentSort": {
            "postdate": "desc"
        }
    },
    "columns": [
        {
            "field": "name",
            "display": null
        },
        {
            "field": "blind_flag",
            "display": null
        },
        {
            "field": "job_desc",
            "display": "Job Description"
        },
        {
            "field": "pickVal",
            "display": null
        },
        {
            "field": "visual_id",
            "display": null
        },
        {
            "field": "job_title",
            "display": null
        },
        {
            "field": "job_start",
            "display": null
        },
        {
            "field": "job_end",
            "display": null
        },
        {
            "field": "application_deadline",
            "display": null
        },
        {
            "field": "ocr_flag",
            "display": null
        },
        {
            "field": "job_type",
            "display": null
        },
        {
            "field": "symp_remote_job",
            "display": null
        },
        {
            "field": "resume_mode",
            "display": null
        },
        {
            "field": "in_app_application",
            "display": "Can apply on App"
        },
        {
            "field": "qualified",
            "display": "Qualified"
        },
        {
            "field": "source",
            "display": null
        },
        {
            "field": "imported_id",
            "display": null
        },
        {
            "field": "contact_info",
            "display": null
        }
    ]
}